{"chunk_id": "5adab627-3ac2-5038-9fd9-246efbcaec0f", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Groups Medusa Group Medusa Group", "order": 0}
{"chunk_id": "1e4c1a20-3c9f-56de-93b3-aaf68c4613f6", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Medusa Group has been active since at least 2021 and was initially operated as a closed ransomware group before evolving into a Ransomware-as-a-Service (RaaS) operation. Some reporting indicates that certain attacks may still be conducted directly by the ransomware’s core developers. Public sources have also referred to the group as \"Spearwing\" or \"Medusa Actors.\" [1] [2] Medusa Group employs living-off-the-land techniques, frequently leveraging publicly available tools and common remote", "order": 1}
{"chunk_id": "ed7eaeb2-8bf4-5a21-a5c7-4d8fcb542ca4", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "management software to conduct operations. The group engages in double extortion tactics, exfiltrating data prior to encryption and threatening to publish stolen information if ransom demands are not met. [3] For initial access, Medusa Group has exploited publicly known vulnerabilities, conducted phishing campaigns, and used credentials or access purchased from Initial Access Brokers (IABs). The group is opportunistic and has targeted a wide range of sectors globally. [4]", "order": 2}
{"chunk_id": "fa70753a-3d40-571e-b5dc-96befc276839", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID: G1051 Version: 1.0 Created: 15 October 2025 Last Modified: 24 October 2025 Version Permalink Live Version Enterprise Layer download view Techniques Used", "order": 3}
{"chunk_id": "52b4702e-c956-59d0-82a9-fa751eeaa8ec", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Domain ID Name Use Enterprise T1548 .002 Abuse Elevation Control Mechanism : Bypass User Account Control Medusa Group has attempted to bypass UAC using Component Object Model (COM) interface. [4] Enterprise T1087 .001 Account Discovery : Local Account Medusa Group has leveraged net user for account discovery. [2] Enterprise T1650 Acquire Access Medusa Group has purchased user credentials and other sensitive data from Initial Access Brokers (IABs). [5] [6] [1] [4]", "order": 4}
{"chunk_id": "c4792bfd-b887-5204-9798-3f730854321c", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1583 .006 Acquire Infrastructure : Web Services Medusa Group has utilized a file hosting service named filemail[.]com to host a zip file that contained malicious payloads that facilitated follow-on actions. [5] Enterprise T1071 .001 Application Layer Protocol : Web Protocols Medusa Group has communicated through reverse or bind shells over port 443 (HTTPS). [1]", "order": 5}
{"chunk_id": "118d47c3-9c1f-5693-9711-2d7772d6ab16", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1059 .001 Command and Scripting Interpreter : PowerShell Medusa Group has leveraged PowerShell for execution and defense evasion. [6] [1] [4] Medusa Group has also utilized PowerShell to execute a bitsadmin transfer from file hosting site. [5] .003 Command and Scripting Interpreter : Windows Command Shell Medusa Group has used Windows Command Prompt to control and execute commands on the system to include ingress, network, and filesystem enumeration activities. [1]", "order": 6}
{"chunk_id": "2817cf17-f402-5ad8-9ad6-c80fe65c337d", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1136 .002 Create Account : Domain Account Medusa Group has created a domain account within the victim environment. [1] Enterprise T1543 .003 Create or Modify System Process : Windows Service Medusa Group has used vulnerable or signed drivers to modify security solutions on victim devices. [1]", "order": 7}
{"chunk_id": "a7d6f8d4-5a0b-5c7b-8167-9cc8c355e04c", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1486 Data Encrypted for Impact Medusa Group has encrypted files using AES-256 encryption which then appends the file extension \".medusa\" to encrypted files and leaves a ransomware note named \"!READ_ME_MEDUSA!!!.txt.\" [5] [1] [2] [3] Enterprise T1652 Device Driver Discovery Medusa Group has queried drivers on the victim device through the command driverquery . [1] Enterprise T1573 .002 Encrypted Channel : Asymmetric Cryptography Medusa Group has used HTTPS for command and control. [1]", "order": 8}
{"chunk_id": "292fcf79-750a-5f95-b3c7-fea6bdf1ca7c", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1585 .001 Establish Accounts : Social Media Accounts Medusa Group has created social media accounts including Telegram and X to publicize their activities. [5] [6] .002 Establish Accounts : Email Accounts Medusa Group has created email accounts used in ransomware negotiations. [1] Enterprise T1567 .002 Exfiltration Over Web Service : Exfiltration to Cloud Storage Medusa Group has utilized Rclone to exfiltrate data from victim environments to cloud storage. [1] [2]", "order": 9}
{"chunk_id": "d3931216-2cc9-5374-9f70-e06325658a1a", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1190 Exploit Public-Facing Application Medusa Group has leveraged public facing vulnerabilities in their campaigns against victim organizations to gain initial access. [5] [2] Medusa Group has also utilized CVE-2024-1709 in ScreenConnect, and CVE-2023-48788 in Fortinet EMS for initial access to victim environments. [1]", "order": 10}
{"chunk_id": "cb8325ec-1c91-5c75-83a7-7c821f7b13b0", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1083 File and Directory Discovery Medusa Group has searched for files within the victim environment for encryption and exfiltration. [5] [1] [3] Medusa Group has also identified files associated with remote management services. [5] [1] Enterprise T1657 Financial Theft Medusa Group has stolen and encrypted victims' data in order to extort victims into paying a ransom. [5] [6] [1] [4] [2] [3]", "order": 11}
{"chunk_id": "d7ebee24-dbdf-5a2a-bdb6-81e6da615d70", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1564 .003 Hide Artifacts : Hidden Window Medusa Group has utilized the ShowWindow API function to hide the current window. [3] Enterprise T1562 .001 Impair Defenses : Disable or Modify Tools Medusa Group has terminated antivirus services utilizing the gaze.exe executable and utilizing psexec.exe . [5] [1] [2] Medusa Group has also leveraged I/O control codes (IOCTLs) for terminating and deleting processes of identified security tools. [5]", "order": 12}
{"chunk_id": "76afbaf3-28fa-579b-8b37-41b6936f8a16", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".003 Impair Defenses : Impair Command History Logging Medusa Group has removed PowerShell command history through the use of the PSReadLine module by running the PowerShell command Remove-Item (Get-PSReadlineOption).HistorySavePath . [1]", "order": 13}
{"chunk_id": "bef3ca1e-13e7-5968-894c-9d6cc8e4833a", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".004 Impair Defenses : Disable or Modify System Firewall Medusa Group has utilized PsExec to execute batch scripts that modify firewall settings. [1] Medusa Group has also enabled and modified firewall rules to allow for RDP connections for lateral movement and device interactions. [1] Enterprise T1070 .003 Indicator Removal : Clear Command History Medusa Group has cleared command history by running the PowerShell command Remove-Item (Get-PSReadlineOption).HistorySavePath . [1]", "order": 14}
{"chunk_id": "85dab59b-fdee-5165-a4cb-a13283a533e4", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".004 Indicator Removal : File Deletion Medusa Group has deleted previously installed tools. [1] Enterprise T1105 Ingress Tool Transfer Medusa Group has leveraged certutil , PowerShell, and Windows Command to download additional tools to include RMM services. [1] Medusa Group has also engaged in \"Bring Your Own Vulnerable Driver\" (BYOVD) and downloaded vulnerable or signed drivers to the victim environment to disable security tools. [1] [2]", "order": 15}
{"chunk_id": "30649fa3-4918-5bb9-8e57-0690cb0ed90c", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1490 Inhibit System Recovery Medusa Group has deleted recovery files such as shadow copies using vssadmin.exe . [5] [1] [2] [3] Enterprise T1559 .001 Inter-Process Communication : Component Object Model Medusa Group has leveraged Component Object Model (COM) to bypass UAC. [4]", "order": 16}
{"chunk_id": "a48499ec-7f2e-5c39-ace5-d35523d9b652", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1570 Lateral Tool Transfer Medusa Group has utilized legitimate software services such as PDQ Deploy to transfer malicious binaries and tools to other victimized hosts within the target environment. [2] Enterprise T1112 Modify Registry Medusa Group has modified Registry keys to elevate privileges, maintain persistence and allow remote access. [1] Enterprise T1106 Native API Medusa Group has leveraged Windows Native API functions to execute payloads. [3]", "order": 17}
{"chunk_id": "68fb07a1-0b99-5ac9-8d23-0e872a2f20aa", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1046 Network Service Discovery Medusa Group has the capability to use living off the land (LOTL) binaries to perform network enumeration. [1] Medusa Group has also utilized the publicly available scanning tool SoftPerfect Network Scanner ( netscan.exe ) to discover device hostnames and network services. [2] Enterprise T1135 Network Share Discovery Medusa Group has identified network shares using cmd.exe /c net share . [1]", "order": 18}
{"chunk_id": "aa9ac99f-aba5-5b44-aaeb-582729c3ca96", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1027 .002 Obfuscated Files or Information : Software Packing Medusa Group has packed the code of dropped kernel drivers using the packer ASM Guard. [5]", "order": 19}
{"chunk_id": "3682ae62-4ad2-5ce3-9aaf-ceb387c35f10", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".010 Obfuscated Files or Information : Command Obfuscation Medusa Group has obfuscated PowerShell scripts with Base64 encoding. [1] Medusa Group has also obfuscated the code of dropped kernel drivers using a software known as Safengine Shielden which randomized the code through code mutations and then leveraged an embedded virtual machine interpreter to execute the code. [5]", "order": 20}
{"chunk_id": "03466e81-e0b5-5f3a-ae24-721a90205f5f", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1588 .002 Obtain Capabilities : Tool Medusa Group has obtained and leveraged numerous RMM services, along with publicly available tools used for scanning. [5] [1] [2] Medusa Group has utilized tools such as Advanced IP Scanner and SoftPerfect Network scanner for user, system and network discovery. [1] Medusa Group has also acquired tools for command and control and defense evasion which include tunneling tools Ligolo and Cloudflared. [1]", "order": 21}
{"chunk_id": "705ebe80-ff57-5ed2-b8ad-14596d5ef0e6", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1003 .001 OS Credential Dumping : LSASS Memory Medusa Group has leveraged Mimikatz to dump LSASS to harvest credentials. [1] .003 OS Credential Dumping : NTDS Medusa Group has accessed the ntds.dit file to engage in credential dumping. [2] Enterprise T1069 .002 Permission Groups Discovery : Domain Groups Medusa Group has utilized the net group command to query domain groups within the victim environment. [1]", "order": 22}
{"chunk_id": "03036901-18fb-58db-8263-979f806b905f", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1057 Process Discovery Medusa Group has utilized a hard-coded security tool process list that identifies and terminates using an undocumented IOCTL code 0x222094. [5] Enterprise T1090 .003 Proxy : Multi-hop Proxy Medusa Group has used TOR nodes for communications. [5] [6] [2]", "order": 23}
{"chunk_id": "8a55d96d-5a24-51b6-b6c6-dd77f5ea8eed", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1219 Remote Access Tools Medusa Group has leveraged Remote Access Software for lateral movement and data exfiltration. [5] [1] [2] [3] Medusa Group has also been known to utilize Remote Access Software such as AnyDesk, Atera, ConnectWise, eHorus, N-Able, PDQ Deploy, PDQ Inventory, SimpleHelp and Splashtop. [1]", "order": 24}
{"chunk_id": "cc592ca6-1e51-5148-bd53-8fc032fe0a22", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1021 .001 Remote Services : Remote Desktop Protocol Medusa Group has used RDP to conduct lateral movement and exfiltrate data. [1] Medusa Group has also utilized the Windows executable mstsc.exe for RDP activities through the command mstsc.exe /v:{hostname/ip} . [1] Enterprise T1018 Remote System Discovery Medusa Group has used PDQ Inventory to get an inventory of the endpoints on the network. [2]", "order": 25}
{"chunk_id": "5f33879e-d230-5b3a-89c8-eecfda426b45", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1505 .003 Server Software Component : Web Shell Medusa Group has utilized webshells to an exploited Microsoft Exchange Server. [5] Enterprise T1489 Service Stop Medusa Group has terminated services related to backups, security, databases, communication, filesharing and websites. [1] [2] [3] Enterprise T1072 Software Deployment Tools Medusa Group has utilized software deployment and management solutions to deploy their encryption payload to include BigFix and PDQ Deploy. [1]", "order": 26}
{"chunk_id": "fd63ad59-9a63-5e95-94de-c902d5b1139d", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1518 .001 Software Discovery : Security Software Discovery Medusa Group has detected security solutions for termination or deletion within the victim device using hard-coded lists of strings containing security product executables. [5] Enterprise T1608 .002 Stage Capabilities : Upload Tool Medusa Group has utilized a file hosting service called filemail[.]com to host a zip file that contained a RMM service such as ConnectWise. [5]", "order": 27}
{"chunk_id": "5b4bc131-6834-5aa6-9581-3d60a2ff895f", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1553 .002 Subvert Trust Controls : Code Signing Medusa Group has utilized vulnerable or signed drivers to kill or delete services associated with endpoint detection and response (EDR) tools. [1] Enterprise T1218 .014 System Binary Proxy Execution : MMC Medusa Group has leveraged Microsoft Management Console (MMC) to facilitate lateral movement and to interact locally or remotely with victim devices using the command mmc.exe compmgmt.msc /computer:{hostname/ip} . [1]", "order": 28}
{"chunk_id": "59682077-e1dc-562b-85a9-90d84c1b38f8", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1082 System Information Discovery Medusa Group has leveraged cmd.exe to identify system info cmd.exe /c systeminfo . [1] Enterprise T1016 System Network Configuration Discovery Medusa Group has obtained host network details utilizing the command cmd.exe /c ipconfig /all . [1] Enterprise T1033 System Owner/User Discovery Medusa Group has utilized PsExec to execute quser to discover the user session information. [2]", "order": 29}
{"chunk_id": "3828cd69-39e0-5b57-b327-57676e2172d1", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1569 .002 System Services : Service Execution Medusa Group has utilized PsExec to execute scripts and commands within victim environments. [5] [1] [2] Medusa Group has also used the Windows service RoboCopy to search and copy data for exfiltration. [2] Enterprise T1529 System Shutdown/Reboot Medusa Group has manually turned off and encrypted virtual machines. [1]", "order": 30}
{"chunk_id": "19b20db7-de8c-5351-86f1-58788f45e03e", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Enterprise T1078 Valid Accounts Medusa Group has utilized compromised legitimate local and domain accounts within the victim environment to facilitate remote access and lateral movement sometimes in combination with PsExec . [1] Enterprise T1047 Windows Management Instrumentation Medusa Group has utilized Windows Management Instrumentation to query system information. [5] [1] [4]", "order": 31}
{"chunk_id": "69782c1c-f5df-5013-a4d4-f092a8805918", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Software", "order": 32}
{"chunk_id": "62980535-25ee-585d-8686-fc4b68df33f8", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "ID Name References Techniques S0160 certutil Medusa Group has utilized certutil to download additional tools within victim environments. [1] Archive Collected Data : Archive via Utility , Deobfuscate/Decode Files or Information , Ingress Tool Transfer , Subvert Trust Controls : Install Root Certificate", "order": 33}
{"chunk_id": "987f6eae-39d5-5c44-a1bb-0b1798f8b95e", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "S1244 Medusa Ransomware Medusa Group has used Medusa Ransomware for ransomware activities. [5] [1] [2] [3]", "order": 34}
{"chunk_id": "9bd62e92-b532-5a0f-9ddc-dc70cf2ff45a", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Command and Scripting Interpreter : Windows Command Shell , Command and Scripting Interpreter : PowerShell , Create or Modify System Process : Windows Service , Data Encrypted for Impact , Deobfuscate/Decode Files or Information , File and Directory Discovery , Hide Artifacts : Hidden Window , Impair Defenses : Disable or Modify Tools , Indicator Removal : File Deletion , Inhibit System Recovery , Inter-Process Communication , Local Storage Discovery , Native API", "order": 35}
{"chunk_id": "9616b2e8-139e-58ea-8e92-930e8a66646a", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ", Network Share Discovery , Obfuscated Files or Information : Encrypted/Encoded File , Process Discovery , Selective Exclusion , Service Stop , Software Discovery : Security Software Discovery , System Information Discovery , System Service Discovery , System Time Discovery", "order": 36}
{"chunk_id": "5f61fc39-e16f-52a7-92c1-2282108633e2", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "S0002 Mimikatz Medusa Group has used Mimikatz to dump LSASS for credential harvesting. [1]", "order": 37}
{"chunk_id": "342cba53-dae9-5e78-b3bf-060e8b76e07e", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Access Token Manipulation : SID-History Injection , Account Manipulation , Boot or Logon Autostart Execution : Security Support Provider , Credentials from Password Stores , Credentials from Password Stores : Credentials from Web Browsers , Credentials from Password Stores : Windows Credential Manager , OS Credential Dumping : DCSync , OS Credential Dumping : Security Account Manager , OS Credential Dumping : LSASS Memory , OS Credential Dumping : LSA Secrets ,", "order": 38}
{"chunk_id": "9090495a-68da-5c5a-bbfc-85da8f64f3aa", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Rogue Domain Controller , Steal or Forge Authentication Certificates , Steal or Forge Kerberos Tickets : Golden Ticket , Steal or Forge Kerberos Tickets : Silver Ticket , Unsecured Credentials : Private Keys , Use Alternate Authentication Material : Pass the Hash , Use Alternate Authentication Material : Pass the Ticket", "order": 39}
{"chunk_id": "acaed2bd-ee4c-59c1-a11d-b3fbdd01efd1", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "S0029 PsExec Medusa Group has utilized PsExec to facilitate execution, lateral movement, defense evasion, and exfiltration. [1] Create Account : Domain Account , Create or Modify System Process : Windows Service , Lateral Tool Transfer , Remote Services : SMB/Windows Admin Shares , System Services : Service Execution", "order": 40}
{"chunk_id": "4a06f4b5-cf38-5060-8a0b-5d6201bd3152", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "S1040 Rclone Medusa Group has leveraged Rclone to exfiltrate data from victim environments. [1] [2] Archive Collected Data : Archive via Utility , Data Transfer Size Limits , Exfiltration Over Alternative Protocol : Exfiltration Over Asymmetric Encrypted Non-C2 Protocol , Exfiltration Over Alternative Protocol : Exfiltration Over Unencrypted Non-C2 Protocol , Exfiltration Over Web Service : Exfiltration to Cloud Storage , File and Directory Discovery", "order": 41}
{"chunk_id": "64999306-838f-5492-affe-8b56b7651b48", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "References Cybersecurity and Infrastructure Security Agency. (2025, March 12). AA25-071A #StopRansomware: Medusa Ransomware. Retrieved October 15, 2025. Threat Hunter Team Symantec and Carbon Black. (2025, March 6). Medusa Ransomware Activity Continues to Increase. Retrieved October 15, 2025. Vlad Pasca. (2024, January 1). A Deep Dive into Medusa Ransomware. Retrieved October 15, 2025. Intel471. (2025, May 14). Threat hunting case study: Medusa ransomware. Retrieved October 15, 2025.", "order": 42}
{"chunk_id": "a447f8e0-688b-520d-bb24-a9c705d95ac4", "doc_id": "7ece7d54-0891-522a-b2a6-ab141d019f73", "filename": "G1051.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Anthony Galiette, Doel Santos. (2024, January 11). Medusa Ransomware Turning Your Files into Stone. Retrieved October 15, 2025. Check Point. (2025, April 16). The 2025 Ransomware Surge: Context for Medusa’s Rise. Retrieved October 15, 2025. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 43}
