{"chunk_id": "04c65e85-b115-5102-a466-d2e365067949", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Acquire Infrastructure Domains Acquire Infrastructure: Domains Other sub-techniques of Acquire Infrastructure (8) ID Name T1583.001 Domains T1583.002 DNS Server T1583.003 Virtual Private Server T1583.004 Server T1583.005 Botnet T1583.006 Web Services T1583.007 Serverless T1583.008 Malvertising", "order": 0}
{"chunk_id": "7b237736-ae94-54f7-856e-862290222ba8", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may acquire domains that can be used during targeting. Domain names are the human readable names used to represent one or more IP addresses. They can be purchased or, in some cases, acquired for free.", "order": 1}
{"chunk_id": "fccb3057-ce9c-5850-897f-2cc2f93c9b20", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may use acquired domains for a variety of purposes, including for Phishing, Drive-by Compromise, and Command and Control.[1] Adversaries may choose domains that are similar to legitimate domains, including through use of homoglyphs or use of a different top-level domain (TLD).[2][3] Typosquatting may be used to aid in delivery of payloads via Drive-by Compromise. Adversaries may also use internationalized domain names (IDNs) and different character sets (e.g. Cyrillic, Greek, etc.)", "order": 2}
{"chunk_id": "c3025e18-ecf4-5a88-81ba-0c252cfdf93c", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "to execute \"IDN homograph attacks,\" creating visually similar lookalike domains used to deliver malware to victim machines.[4][5][6][7][8]", "order": 3}
{"chunk_id": "a4374a19-a9b2-5b68-a2e5-4b12155a1086", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Different URIs/URLs may also be dynamically generated to uniquely serve malicious content to victims (including one-time, single use domain names).[9][10][11][12] Adversaries may also acquire and repurpose expired domains, which may be potentially already allowlisted/trusted by defenders based on an existing reputation/history.[13][14][15][16]", "order": 4}
{"chunk_id": "732129ea-cdd0-50c9-9d0c-08e989e0e890", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Domain registrars each maintain a publicly viewable database that displays contact information for every registered domain. Private WHOIS services display alternative information, such as their own company data, rather than the owner of the domain. Adversaries may use such private WHOIS services to obscure information about who owns a purchased domain. Adversaries may further interrupt efforts to track their infrastructure by using varied registration information and purchasing domains with", "order": 5}
{"chunk_id": "b3f1135e-df28-5469-b0b1-541a35aa6bc2", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "different domain registrars.[17]", "order": 6}
{"chunk_id": "a71531b2-597a-5594-a903-12aae587b22f", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "In addition to legitimately purchasing a domain, an adversary may register a new domain in a compromised environment. For example, in AWS environments, adversaries may leverage the Route53 domain service to register a domain and create hosted zones pointing to resources of the threat actor’s choosing.[18] ID: T1583.001 Sub-technique of: T1583 Tactic: Resource Development Platforms: PRE", "order": 7}
{"chunk_id": "d0402ccd-31ab-5586-81e3-738fde6c3aa4", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Contributors: Deloitte Threat Library Team; Menachem Goldstein; Nikola Kovac; Oleg Kolesnikov, Securonix; Vinayak Wadhwa, Lucideus; Wes Hurd Version: 1.4 Created: 30 September 2020 Last Modified: 24 October 2025 Version Permalink Live Version Procedure Examples", "order": 8}
{"chunk_id": "2253d394-d743-5e74-8ce3-de572e6a3c6c", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "ID Name Description G0006 APT1 APT1 has registered hundreds of domains for use in operations. [17] G0007 APT28 APT28 registered domains imitating NATO, OSCE security websites, Caucasus information resources, and other organizations. [2] [19] [20] G0050 APT32 APT32 has set up and operated websites to gather information and deliver malware. [21] G0082 APT38 APT38 has created fake domains to imitate legitimate venture capital or bank domains. [22]", "order": 9}
{"chunk_id": "943b1941-c4c5-54a0-af72-2607caae0457", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G1044 APT42 APT42 has registered domains, several of which masqueraded as news outlets and login services, for use in operations. [23] [24] G1002 BITTER BITTER has registered a variety of domains to host malicious payloads and for C2. [25] C0010 C0010 For C0010 , UNC3890 actors established domains that appeared to be legitimate services and entities, such as LinkedIn, Facebook, Office 365, and Pfizer. [26]", "order": 10}
{"chunk_id": "13acab2a-e10e-5232-8dd4-ade967c8b5a8", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "C0011 C0011 For C0011 , Transparent Tribe registered domains likely designed to appear relevant to student targets in India. [27] C0021 C0021 For C0021 , the threat actors registered domains for use in C2. [28] C0026 C0026 For C0026 , the threat actors re-registered expired C2 domains previously used for ANDROMEDA malware. [29]", "order": 11}
{"chunk_id": "aa8bde82-f796-5161-9a8b-3abc2d6b48be", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G1052 Contagious Interview Contagious Interview has registered domains to leverage in their social engineering campaigns. [30] [31] [32] Contagious Interview has also registered domains to utilize for C2. [33] [34] [35] [36] [37] [38] C0004 CostaRicto For CostaRicto , the threat actors established domains, some of which appeared to spoof legitimate domains. [39] G1012 CURIUM CURIUM created domains to facilitate strategic website compromise and credential capture activities. [40]", "order": 12}
{"chunk_id": "86042a8d-72e6-518e-83f2-13aaff6a3faf", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "S1111 DarkGate DarkGate command and control includes hard-coded domains in the malware chosen to masquerade as legitimate services such as Akamai CDN or Amazon Web Services. [41] G0035 Dragonfly Dragonfly has registered domains for targeting intended victims. [42] G1006 Earth Lusca Earth Lusca has registered domains, intended to look like legitimate target domains, that have been used in watering hole attacks. [43]", "order": 13}
{"chunk_id": "c100c3ff-a531-5698-a576-8b702f45a4cb", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G1011 EXOTIC LILY EXOTIC LILY has registered domains to spoof targeted organizations by changing the top-level domain (TLD) to \".us\", \".co\" or \".biz\". [44] G0137 Ferocious Kitten Ferocious Kitten has acquired domains imitating legitimate sites. [45]", "order": 14}
{"chunk_id": "d42c17ea-be3e-5e97-807f-4b5d9b52379c", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G0046 FIN7 FIN7 has registered look-alike domains for use in phishing campaigns. [46] Additionally, FIN7 has registered a malicious domain as advanced-ip-sccanner[.]com that redirected to an adversary-controlled Dropbox which contained the malicious executable. [47] C0007 FunnyDream For FunnyDream , the threat actors registered a variety of domains. [48] G0047 Gamaredon Group Gamaredon Group has registered multiple domains to facilitate payload staging and C2. [49] [50] [51] [52]", "order": 15}
{"chunk_id": "df74d13c-9204-52f7-9381-6311eb262cd5", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G1001 HEXANE HEXANE has registered and operated domains for campaigns, often using a security or web technology theme or impersonating the targeted organization. [53] [54] [55] C0043 Indian Critical Infrastructure Intrusions During Indian Critical Infrastructure Intrusions , RedEcho registered domains spoofing Indian critical infrastructure entities. [56]", "order": 16}
{"chunk_id": "eb39691b-b202-5bf5-8d9f-f55bcc53fd26", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G0136 IndigoZebra IndigoZebra has established domains, some of which were designed to look like official government domains, for their operations. [57] G0094 Kimsuky Kimsuky has registered domains to spoof targeted organizations and trusted third parties including search engines, web platforms, and cryptocurrency exchanges. [58] [59] [60] [61] [62] [63] [64] [65]", "order": 17}
{"chunk_id": "bf13d5b0-4697-559f-8797-11aecd35a37e", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G0032 Lazarus Group Lazarus Group has acquired domains related to their campaigns to act as distribution points and C2 channels. [66] [67] G0140 LazyScripter LazyScripter has used dynamic DNS providers to create legitimate-looking subdomains for C2. [68] G0065 Leviathan Leviathan has established domains that impersonate legitimate entities to use for targeting efforts. [69] [70]", "order": 18}
{"chunk_id": "fee67e3e-7359-5af3-bfdc-41aa71389171", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G0059 Magic Hound Magic Hound has registered fraudulent domains such as \"mail-newyorker.com\" and \"news12.com.recover-session-service.site\" to target specific victims with phishing attacks. [71] G0045 menuPass menuPass has registered malicious domains for use in intrusion campaigns. [72] [73] G1036 Moonstone Sleet Moonstone Sleet registered domains to develop effective personas for fake companies used in phishing activity. [74]", "order": 19}
{"chunk_id": "c27944ec-38b8-5593-8390-da2bd6c8e0ec", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G0129 Mustang Panda Mustang Panda has acquired C2 domains prior to operations. [75] [76] [77] [78] [79] [80] [81] [82] [83] G0049 OilRig OilRig has set up fake VPN portals, conference sign ups, and job application websites to target victims. [84] C0022 Operation Dream Job During Operation Dream Job , Lazarus Group registered a domain name identical to that of a compromised company as part of their BEC effort. [85]", "order": 20}
{"chunk_id": "66d3e4b6-81f7-513f-8b01-50ad563a2522", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "C0016 Operation Dust Storm For Operation Dust Storm , the threat actors established domains as part of their operational infrastructure. [86] C0023 Operation Ghost For Operation Ghost , APT29 registered domains for use in C2 including some crafted to appear as existing legitimate domains. [87] C0006 Operation Honeybee During Operation Honeybee , threat actors registered domains for C2. [88]", "order": 21}
{"chunk_id": "1d82c598-2737-56a2-838e-2e62255678be", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "C0005 Operation Spalax For Operation Spalax , the threat actors registered hundreds of domains using Duck DNS and DNS Exit. [89] S1130 Raspberry Robin Raspberry Robin uses newly-registered domains containing only a few characters for command and controll purposes, such as \" v0[.]cx \". [90]", "order": 22}
{"chunk_id": "8c88c23f-0668-5eb8-84c3-06295aaccacc", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "C0047 RedDelta Modified PlugX Infection Chain Operations Mustang Panda registered adversary-controlled domains during RedDelta Modified PlugX Infection Chain Operations that were re-registrations of expired domains. [91] G1042 RedEcho RedEcho has registered domains spoofing Indian critical infrastructure entities. [56]", "order": 23}
{"chunk_id": "a79225d9-020b-5e14-8bcb-1448867ad3eb", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G0034 Sandworm Team Sandworm Team has registered domain names and created URLs that are often designed to mimic or spoof legitimate websites, such as email login pages, online file sharing and storage websites, and password reset pages, while also hosting these items on legitimate, compromised network infrastructure. [92] [93] G1015 Scattered Spider Scattered Spider has registered domains to spoof legitimate corporate login portals. [94]", "order": 24}
{"chunk_id": "8bb60eaf-229e-50da-9135-849015f07490", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G1041 Sea Turtle Sea Turtle registered domains for authoritative name servers used in DNS hijacking activity and for command and control servers. [95] [96] C0058 SharePoint ToolShell Exploitation During SharePoint ToolShell Exploitation , threat actors registered C2 domains to spoof legitimate Microsoft domains. [97] [98]", "order": 25}
{"chunk_id": "c8bc83fa-f9d8-5e9a-b5aa-1cf2069aa2a7", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G0122 Silent Librarian Silent Librarian has acquired domains to establish credential harvesting pages, often spoofing the target organization and using free top level domains .TK, .ML, .GA, .CF, and .GQ. [99] [100] [101] [102] [103] [104] C0024 SolarWinds Compromise For the SolarWinds Compromise , APT29 acquired C2 domains, sometimes through resellers. [105] [106]", "order": 26}
{"chunk_id": "a2e67713-f0bd-5ec5-8fe4-498f522a7777", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G1033 Star Blizzard Star Blizzard has registered domains using randomized words and with names resembling legitimate organizations. [107] [108] G1046 Storm-1811 Storm-1811 has created domains for use with RMM tools. [109] G1018 TA2541 TA2541 has registered domains often containing the keywords \"kimjoy,\" \"h0pe,\" and \"grace,\" using domain registrars including Netdorm and No-IP DDNS, and hosting providers including xTom GmbH and Danilenko, Artyom. [110] [111]", "order": 27}
{"chunk_id": "bd1e6095-f968-5cf9-9ec1-ca162c33df42", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G0092 TA505 TA505 has registered domains to impersonate services such as Dropbox to distribute malware. [112] G0139 TeamTNT TeamTNT has obtained domains to host their payloads. [113] G0027 Threat Group-3390 Threat Group-3390 has registered domains for C2. [114] G0134 Transparent Tribe Transparent Tribe has registered domains to mimic file sharing, government, defense, and research websites for use in targeted campaigns. [115] [116]", "order": 28}
{"chunk_id": "01f242a7-6ed0-55f8-902b-dfeccacaecb9", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G0044 Winnti Group Winnti Group has registered domains for C2 that mimicked sites of their intended targets. [117] G1035 Winter Vivern Winter Vivern registered domains mimicking other entities throughout various campaigns. [118] S1207 XLoader XLoader can utilize hardcoded command and control domain configurations created by the XLoader authors. These are designed to mimic domain registrars and hosting service providers such as Hostinger and Namecheap. [119]", "order": 29}
{"chunk_id": "5f3faaaf-2a3b-5828-814a-2e5f8c711680", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G0128 ZIRCONIUM ZIRCONIUM has purchased domains for use in targeted campaigns. [120]", "order": 30}
{"chunk_id": "ef65aaf7-995d-5181-bdb6-ca15d6063e1e", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Mitigations ID Mitigation Description M1056 Pre-compromise Organizations may intentionally register similar domains to their own to deter adversaries from creating typosquatting domains. Other facets of this technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Detection Strategy", "order": 31}
{"chunk_id": "d93720e7-20a6-5d52-9413-67ee1dc35949", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "ID Name Analytic ID Analytic Description", "order": 32}
{"chunk_id": "623c7a4c-d92c-5ceb-8cd5-97b6b38e8828", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "DET0892 Detection of Domains AN2024", "order": 33}
{"chunk_id": "50009a1b-66d7-5705-8659-3f3d50618d3a", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Monitor logged domain name system (DNS) data for purchased domains that can be used during targeting. Reputation/category-based detection may be difficult until the categorization is updated. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access and Command and Control. Domain registration information is, by design, captured in public registration logs. Consider use of services that may aid in tracking of", "order": 34}
{"chunk_id": "c032fa71-c1c0-539b-8fba-3e4c879ec0e0", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "newly acquired domains, such as WHOIS databases and/or passive DNS. In some cases it may be possible to pivot on known pieces of domain registration information to uncover other infrastructure purchased by the adversary. Consider monitoring for domains created with a similar structure to your own, including under a different TLD. Though various tools and services exist to track, query, and monitor domain name registration information, tracking across multiple DNS", "order": 35}
{"chunk_id": "fc6d3fb3-972e-535e-8edb-d3f17b538797", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "infrastructures can require multiple tools/services or more advanced analytics. [121] Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access and Command and Control. Monitor queried domain name system (DNS) registry data for purchased domains that can be used during targeting. Reputation/category-based detection may be difficult until the categorization is updated. Detection efforts may be focused on related", "order": 36}
{"chunk_id": "a20699c4-ee4e-5326-a8b9-ed749484c24b", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "stages of the adversary lifecycle, such as during Initial Access and Command and Control.", "order": 37}
{"chunk_id": "08e481ea-18a1-5b31-be68-67c805dde7a8", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "References CISA. (2020, September 14). Alert (AA20-258A): Chinese Ministry of State Security-Affiliated Cyber Threat Actor Activity. Retrieved October 1, 2020. FireEye. (2015). APT28: A WINDOW INTO RUSSIA’S CYBER ESPIONAGE OPERATIONS?. Retrieved August 19, 2015. Bob Sullivan. (2000, July 24). PayPal alert! Beware the 'PaypaI' scam. Retrieved March 2, 2017. CISA. (2019, September 27). Security Tip (ST05-016): Understanding Internationalized Domain Names. Retrieved October 20, 2020.", "order": 38}
{"chunk_id": "d33e507d-5f1d-5ec3-a410-60c00fc8a2e7", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Malhotra, A., Thattil, J. et al. (2022, March 29). Transparent Tribe campaign uses new bespoke malware to target Indian government officials . Retrieved September 6, 2022. Malhotra, A., McKay, K. et al. (2021, May 13). Transparent Tribe APT expands its Windows malware arsenal . Retrieved July 29, 2022. RISKIQ. (2022, March 15). RiskIQ Threat Intelligence Roundup: Campaigns Targeting Ukraine and Global Malware Infrastructure. Retrieved July 29, 2022.", "order": 39}
{"chunk_id": "dc60dac2-e4d6-52d4-a908-f10af2105246", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "RISKIQ. (2017, December 20). Mining Insights: Infrastructure Analysis of Lazarus Group Cyber Attacks on the Cryptocurrency Industry. Retrieved July 29, 2022. Ostorlab. (n.d.). iOS URL Scheme Hijacking. Retrieved February 9, 2024. Michael Cobb. (2007, October 11). Preparing for uniform resource identifier (URI) exploits. Retrieved February 9, 2024. Nathan McFeters. Billy Kim Rios. Rob Carter.. (2008). URI Use and Abuse. Retrieved February 9, 2024.", "order": 40}
{"chunk_id": "25c2811d-e9a5-5a12-a1e5-a48807a495bb", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Australian Cyber Security Centre. National Security Agency. (2020, April 21). Detect and Prevent Web Shell Malware. Retrieved February 9, 2024. MDSec Research. (2017, July). Categorisation is not a Security Boundary. Retrieved September 20, 2019. Krebs, B. (2018, November 13). That Domain You Forgot to Renew? Yeah, it’s Now Stealing Credit Cards. Retrieved September 20, 2019. Mudge, R. (2017, February 6). High-reputation Redirectors and Domain Fronting. Retrieved July 11, 2022.", "order": 41}
{"chunk_id": "9ee6b58b-ed17-55ca-9d54-fbdd0692416b", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Fehrman, B. (2017, April 13). How to Bypass Web-Proxy Filtering. Retrieved September 20, 2019. Mandiant. (n.d.). APT1 Exposing One of China’s Cyber Espionage Units. Retrieved July 18, 2016. Invictus Incident Response. (2024, January 31). The curious case of DangerDev@protonmail.me. Retrieved March 19, 2024. Brady, S . (2018, October 3). Indictment - United States vs Aleksei Sergeyevich Morenets, et al.. Retrieved October 1, 2020.", "order": 42}
{"chunk_id": "9de68588-a493-529b-8dc0-1fa0fd299ef8", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Huntley, S. (2022, March 7). An update on the threat landscape. Retrieved March 16, 2022. Adair, S. and Lancaster, T. (2020, November 6). OceanLotus: Extending Cyber Espionage Operations Through Fake Websites. Retrieved November 20, 2020. SEONGSU PARK. (2022, December 27). BlueNoroff introduces new methods bypassing MoTW. Retrieved February 6, 2024. Mandiant. (n.d.). APT42: Crooked Charms, Cons and Compromises. Retrieved October 9, 2024.", "order": 43}
{"chunk_id": "3bdc91b3-1782-5cb7-917b-9c1fcd5fcffd", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Google Threat Analysis Group. (2024, August 14). Iranian backed group steps up phishing campaigns against Israel, U.S.. Retrieved October 9, 2024. Dela Paz, R. (2016, October 21). BITTER: a targeted attack against Pakistan. Retrieved June 1, 2022. Mandiant Israel Research Team. (2022, August 17). Suspected Iranian Actor Targeting Israeli Shipping, Healthcare, Government and Energy Sectors. Retrieved September 21, 2022.", "order": 44}
{"chunk_id": "b15b4b52-686c-57ef-a654-29df2813263a", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "N. Baisini. (2022, July 13). Transparent Tribe begins targeting education sector in latest campaign. Retrieved September 22, 2022. Dunwoody, M., et al. (2018, November 19). Not So Cozy: An Uncomfortable Examination of a Suspected APT29 Phishing Campaign. Retrieved November 27, 2018. Hawley, S. et al. (2023, February 2). Turla: A Galaxy of Opportunity. Retrieved May 15, 2023. Insikt Group. (2025, February 13). Inside the Scam: North Korea’s IT Worker Threat. Retrieved October 17, 2025.", "order": 45}
{"chunk_id": "9ec70927-0bbd-5c36-a376-06283b3defc2", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Matej Havranek. (2025, February 20). DeceptiveDevelopment targets freelance developers. Retrieved October 17, 2025. Unit42. (2024, October 9). Contagious Interview: DPRK Threat Actors Lure Tech Industry Job Seekers to Install New Variants of BeaverTail and InvisibleFerret Malware. Retrieved October 17, 2025.", "order": 46}
{"chunk_id": "1ecb3dec-3d29-5419-a6bf-cfd27f63cbcf", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Aleksandar Milenkoski, Sreekar Madabushi, Kenneth Kinion. (2025, September 4). Contagious Interview | North Korean Threat Actors Reveal Plans and Ops by Abusing Cyber Intel Platforms. Retrieved October 20, 2025. Amaury G., Coline Chavane, Felix Aimé and Sekoia TDR. (2025, March 31). From Contagious to ClickFake Interview: Lazarus leveraging the ClickFix tactic. Retrieved April 1, 2025.", "order": 47}
{"chunk_id": "e660aca2-5c8f-582e-aad5-dcfcdcf26e9f", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Efstratios Lontzetidis. (2025, January 16). Lazarus APT: Techniques for Hunting Contagious Interview. Retrieved October 20, 2025. Kirill Boychenko. (2025, April 4). Lazarus Expands Malicious npm Campaign: 11 New Packages Add Malware Loaders and Bitbucket Payloads. Retrieved October 20, 2025. Kirill Boychenko. (2025, July 14). Contagious Interview Campaign Escalates With 67 Malicious npm Packages and New Malware Loader. Retrieved October 19, 2025.", "order": 48}
{"chunk_id": "9a9fcc42-f732-5ac5-8af8-3bc6114b6cb4", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Kirill Boychenko. (2025, June 25). Another Wave: North Korean Contagious Interview Campaign Drops 35 New Malicious npm Packages. Retrieved October 19, 2025. The BlackBerry Research and Intelligence Team. (2020, November 12). The CostaRicto Campaign: Cyber-Espionage Outsourced. Retrieved May 24, 2021. PwC Threat Intelligence. (2023, October 25). Yellow Liderc ships its scripts and delivers IMAPLoader malware. Retrieved August 14, 2024.", "order": 49}
{"chunk_id": "2328d8f1-76c3-54ca-ac28-1195a7b3b450", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Ernesto Fernández Provecho, Pham Duy Phuc, Ciana Driscoll & Vinoo Thomas. (2023, November 21). The Continued Evolution of the DarkGate Malware-as-a-Service. Retrieved February 9, 2024. CISA. (2020, December 1). Russian State-Sponsored Advanced Persistent Threat Actor Compromises U.S. Government Targets. Retrieved December 9, 2021. Chen, J., et al. (2022). Delving Deep: An Analysis of Earth Lusca’s Operations. Retrieved July 1, 2022.", "order": 50}
{"chunk_id": "776363b5-e7ab-5892-b80c-879ebd0d1514", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Stolyarov, V. (2022, March 17). Exposing initial access broker with ties to Conti. Retrieved August 18, 2022. GReAT. (2021, June 16). Ferocious Kitten: 6 Years of Covert Surveillance in Iran. Retrieved September 22, 2021. eSentire. (2021, July 21). Notorious Cybercrime Gang, FIN7, Lands Malware in Law Firm Using Fake Legal Complaint Against Jack Daniels’ Owner, Brown-Forman Inc.. Retrieved September 20, 2021.", "order": 51}
{"chunk_id": "83f43302-e4bb-515a-9dfe-945b157d07fd", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "The BlackBerry Research and Intelligence Team. (2024, April 17). Threat Group FIN7 Targets the U.S. Automotive Industry. Retrieved May 1, 2025. Vrabie, V. (2020, November). Dissecting a Chinese APT Targeting South Eastern Asian Government Institutions. Retrieved September 19, 2022. Microsoft Threat Intelligence Center. (2022, February 4). ACTINIUM targets Ukrainian organizations. Retrieved February 18, 2022.", "order": 52}
{"chunk_id": "67d3161a-a8da-5703-bbe4-7ded9437a794", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Unit 42. (2022, February 3). Russia’s Gamaredon aka Primitive Bear APT Group Actively Targeting Ukraine. Retrieved February 21, 2022. Rusnák, Z. (2024, September 26). Cyberespionage the Gamaredon way: Analysis of toolset used to spy on Ukraine in 2022 and 2023. Retrieved October 30, 2024. Threat Hunter Team, Symantec and Carbon Black. (2025, April 10). Shuckworm Targets Foreign Military Mission Based in Ukraine. Retrieved July 23, 2025.", "order": 53}
{"chunk_id": "216ab3e0-c402-5c6f-96c5-220ddea6a2bf", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "SecureWorks 2019, August 27 LYCEUM Takes Center Stage in Middle East Campaign Retrieved. 2019/11/19 Dragos. (n.d.). Hexane. Retrieved October 27, 2019. ClearSky Cyber Security . (2021, August). New Iranian Espionage Campaign By “Siamesekitten” - Lyceum. Retrieved June 6, 2022. Recorded Future Insikt Group. (2021, February). China-Linked Group RedEcho Targets the Indian Power Sector Amid Heightened Border Tensions. Retrieved November 21, 2024.", "order": 54}
{"chunk_id": "49d2808d-c666-5da1-8072-bf907d7eda86", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "CheckPoint Research. (2021, July 1). IndigoZebra APT continues to attack Central Asia with evolving tools. Retrieved September 24, 2021. ThreatConnect. (2020, September 28). Kimsuky Phishing Operations Putting In Work. Retrieved October 30, 2020. Cimpanu, C. (2020, September 30). North Korea has tried to hack 11 officials of the UN Security Council. Retrieved November 4, 2020. CISA, FBI, CNMF. (2020, October 27). https://us-cert.cisa.gov/ncas/alerts/aa20-301a. Retrieved November 4, 2020.", "order": 55}
{"chunk_id": "babdee62-7108-5ef6-9860-5fe4bca75177", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Dahan, A. et al. (2020, November 2). Back to the Future: Inside the Kimsuky KGH Spyware Suite. Retrieved November 6, 2020. Jazi, H. (2021, June 1). Kimsuky APT continues to target South Korean government using AppleSeed backdoor. Retrieved June 10, 2021. KISA. (2021). Phishing Target Reconnaissance and Attack Resource Analysis Operation Muzabi. Retrieved March 8, 2024. Mandiant. (2024, March 14). APT43: North Korean Group Uses Cybercrime to Fund Espionage Operations. Retrieved May 3, 2024.", "order": 56}
{"chunk_id": "29339a28-cd97-598f-828d-9db1587c4252", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Mandiant. (n.d.). APT43: North Korean Group Uses Cybercrime to Fund Espionage Operations. Retrieved October 14, 2024. Cybersecurity and Infrastructure Security Agency. (2021, February 21). AppleJeus: Analysis of North Korea’s Cryptocurrency Malware. Retrieved March 1, 2021. Weidemann, A. (2021, January 25). New campaign targeting security researchers. Retrieved December 20, 2021. Jazi, H. (2021, February). LazyScripter: From Empire to double RAT. Retrieved November 17, 2024.", "order": 57}
{"chunk_id": "75b9c2af-88a4-571e-951c-efe63279db13", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "CISA. (2021, July 19). (AA21-200A) Joint Cybersecurity Advisory – Tactics, Techniques, and Procedures of Indicted APT40 Actors Associated with China’s MSS Hainan State Security Department. Retrieved August 12, 2021. Accenture iDefense Unit. (2019, March 5). Mudcarp's Focus on Submarine Technologies. Retrieved August 24, 2021. Certfa Labs. (2021, January 8). Charming Kitten’s Christmas Gift. Retrieved May 3, 2021.", "order": 58}
{"chunk_id": "a7e692bd-5dfd-5691-90bd-54076f6dfbac", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "United States District Court Southern District of New York (USDC SDNY) . (2018, December 17). United States of America v. Zhu Hua and Zhang Shilong. Retrieved April 17, 2019. US District Court Southern District of New York. (2018, December 17). United States v. Zhu Hua Indictment. Retrieved December 17, 2020. Microsoft Threat Intelligence. (2024, May 28). Moonstone Sleet emerges as new North Korean threat actor with new bag of tricks. Retrieved August 26, 2024.", "order": 59}
{"chunk_id": "eae627c2-025c-5233-81d2-7a09e6c58146", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Counter Threat Unit Research Team. (2019, December 29). BRONZE PRESIDENT Targets NGOs. Retrieved April 13, 2021. CSIRT CTI. (2024, January 23). Stately Taurus Targets Myanmar Amidst Concerns over Military Junta’s Handling of Rebel Attacks. Retrieved August 4, 2025. Dex. (n.d.). New Mustang Panda’s campaing against Australia. Retrieved August 4, 2025.", "order": 60}
{"chunk_id": "c0d58460-90f4-510e-a82d-7a7a4daf2889", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Insikt Group. (2020, July 28). CHINESE STATE-SPONSORED GROUP ‘REDDELTA’ TARGETS THE VATICAN AND CATHOLIC ORGANIZATIONS. Retrieved April 13, 2021. Nathaniel Morales, Nick Dai. (2025, February 18). Earth Preta Mixes Legitimate and Malicious Components to Sidestep Detection. Retrieved September 10, 2025. Patrick Whitsell. (2025, August 25). Deception in Depth: PRC-Nexus Espionage Campaign Hijacks Web Traffic to Target Diplomats. Retrieved September 9, 2025.", "order": 61}
{"chunk_id": "160262b8-406e-587f-8459-e9596ca9825b", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Robert Falcone, Mike Scott, Juan Cortes. (2015, November 10). Bookworm Trojan: A Model of Modular Architecture. Retrieved July 21, 2025. Robert Falcone. (2025, February 20). Stately Taurus Activity in Southeast Asia Links to Bookworm Malware. Retrieved July 21, 2025. Roccia, T., Seret, T., Fokker, J. (2021, March 16). Technical Analysis of Operation Dianxun. Retrieved April 13, 2021.", "order": 62}
{"chunk_id": "b5122c5d-4c22-56ab-959c-04456334e987", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ClearSky Cybersecurity. (2017, January 5). Iranian Threat Agent OilRig Delivers Digitally Signed Malware, Impersonates University of Oxford. Retrieved May 3, 2017. Breitenbacher, D and Osis, K. (2020, June 17). OPERATION IN(TER)CEPTION: Targeted Attacks Against European Aerospace and Military Companies. Retrieved December 20, 2021. Gross, J. (2016, February 23). Operation Dust Storm. Retrieved December 22, 2021.", "order": 63}
{"chunk_id": "a3485e37-54be-56cf-8018-774cee98ec9e", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Faou, M., Tartare, M., Dupuy, T. (2019, October). OPERATION GHOST. Retrieved September 23, 2020. Sherstobitoff, R. (2018, March 02). McAfee Uncovers Operation Honeybee, a Malicious Document Campaign Targeting Humanitarian Aid Groups. Retrieved May 16, 2018. M. Porolli. (2021, January 21). Operation Spalax: Targeted malware attacks in Colombia. Retrieved September 16, 2022. Lauren Podber and Stef Rand. (2022, May 5). Raspberry Robin gets the worm early. Retrieved May 17, 2024.", "order": 64}
{"chunk_id": "1ea2f0aa-97e1-5404-847e-3e7297520724", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Insikt Group. (2025, January 9). Chinese State-Sponsored RedDelta Targeted Taiwan, Mongolia, and Southeast Asia with Adapted PlugX Infection Chain. Retrieved January 14, 2025. Scott W. Brady. (2020, October 15). United States vs. Yuriy Sergeyevich Andrienko et al.. Retrieved November 25, 2020. Joseph Slowik, DomainTools. (2021, March 3). Centreon to Exim and Back: On the Trail of Sandworm. Retrieved April 6, 2024.", "order": 65}
{"chunk_id": "2cf91c74-e32f-5a6d-90df-2f858b7226d2", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Check Point Team. (2025, July 7). Exposing Scattered Spider: New Indicators Highlight Growing Threat to Enterprises and Aviation. Retrieved October 13, 2025. Paul Rascagneres. (2019, July 9). Sea Turtle keeps on swimming, finds new victims, DNS hijacking techniques. Retrieved November 20, 2024. Hunt & Hackett Research Team. (2024, January 5). Turkish espionage campaigns in the Netherlands. Retrieved November 20, 2024.", "order": 66}
{"chunk_id": "933c2400-f814-54d1-a5c5-1141b0db5f1f", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Microsoft Threat Intelligence. (2025, July 22). Disrupting active exploitation of on-premises SharePoint vulnerabilities. Retrieved October 15, 2025. Unit 42. (2025, July 31). Active Exploitation of Microsoft SharePoint Vulnerabilities: Threat Brief (Updated). Retrieved October 15, 2025. DOJ. (2018, March 23). U.S. v. Rafatnejad et al . Retrieved February 3, 2021.", "order": 67}
{"chunk_id": "7755b8a8-b824-5105-8415-e98a7f08c026", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Hassold, Crane. (2018, March 26). Silent Librarian: More to the Story of the Iranian Mabna Institute Indictment. Retrieved February 3, 2021. Counter Threat Unit Research Team. (2018, August 24). Back to School: COBALT DICKENS Targets Universities. Retrieved February 3, 2021. Proofpoint Threat Insight Team. (2019, September 5). Threat Actor Profile: TA407, the Silent Librarian. Retrieved February 3, 2021.", "order": 68}
{"chunk_id": "36fd8274-c7bc-53e9-9fef-0aafdc1bc895", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Counter Threat Unit Research Team. (2019, September 11). COBALT DICKENS Goes Back to School…Again. Retrieved February 3, 2021. Malwarebytes Threat Intelligence Team. (2020, October 14). Silent Librarian APT right on schedule for 20/21 academic year. Retrieved February 3, 2021. Nafisi, R., Lelli, A. (2021, March 4). GoldMax, GoldFinder, and Sibot: Analyzing NOBELIUM’s layered persistence. Retrieved March 8, 2021.", "order": 69}
{"chunk_id": "aab911e6-f6fb-5016-b272-82d60444eeb4", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Smith, L., Leathery, J., Read, B. (2021, March 4). New SUNSHUTTLE Second-Stage Backdoor Uncovered Targeting U.S.-Based Entity; Possible Connection to UNC2452. Retrieved March 12, 2021. CISA, et al. (2023, December 7). Russian FSB Cyber Actor Star Blizzard Continues Worldwide Spear-phishing Campaigns. Retrieved June 13, 2024. Microsoft Threat Intelligence. (2023, December 7). Star Blizzard increases sophistication and evasion in ongoing attacks. Retrieved February 13, 2024.", "order": 70}
{"chunk_id": "8fdd7ed7-2639-52c8-b58e-180cf807fa97", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Tyler McGraw, Thomas Elkins, and Evan McCann. (2024, May 10). Ongoing Social Engineering Campaign Linked to Black Basta Ransomware Operators. Retrieved January 31, 2025. Larson, S. and Wise, J. (2022, February 15). Charting TA2541's Flight. Retrieved September 12, 2023. Ventura, V. (2021, September 16). Operation Layover: How we tracked an attack on the aviation industry to five years of compromise. Retrieved September 15, 2023.", "order": 71}
{"chunk_id": "83247a56-881d-51c9-acd9-5ec7c9f5a869", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Financial Security Institute. (2020, February 28). Profiling of TA505 Threat Group That Continues to Attack the Financial Sector. Retrieved July 14, 2022. Quist, N. (2020, October 5). Black-T: New Cryptojacking Variant from TeamTNT. Retrieved September 22, 2021. Daniel Lunghi. (2023, March 1). Iron Tiger’s SysUpdate Reappears, Adds Linux Targeting. Retrieved March 20, 2023. Huss, D. (2016, March 1). Operation Transparent Tribe. Retrieved June 8, 2016.", "order": 72}
{"chunk_id": "f7be0bf0-a983-5cbe-9cce-673d7b79c6b6", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Malhotra, A. et al. (2021, May 13). Transparent Tribe APT expands its Windows malware arsenal. Retrieved September 2, 2021. Kaspersky Lab's Global Research and Analysis Team. (2013, April 11). Winnti. More than just a game. Retrieved February 8, 2017. Chad Anderson. (2021, April 27). Winter Vivern: A Look At Re-Crafted Government MalDocs Targeting Multiple Languages. Retrieved July 29, 2024.", "order": 73}
{"chunk_id": "2507c6d7-b80a-58c9-99d2-21e74460f189", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Alexey Bukhteyev & Raman Ladutska, Check Point Research. (2022, May 31). XLoader Botnet: Find Me If You Can. Retrieved March 11, 2025. Burt, T. (2020, September 10). New cyberattacks targeting U.S. elections. Retrieved March 24, 2021. ThreatConnect. (2020, December 15). Infrastructure Research and Hunting: Boiling the Domain Ocean. Retrieved October 12, 2021. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences", "order": 74}
{"chunk_id": "832db58d-6909-56d8-9466-6e6f162dc70a", "doc_id": "dc2312ae-df08-54ac-8d89-444df7059c41", "filename": "T1583.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "© 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 75}
