{"chunk_id": "3b533564-d2ef-5c88-9639-442dea5015aa", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Compromise Accounts Email Accounts Compromise Accounts: Email Accounts Other sub-techniques of Compromise Accounts (3) ID Name T1586.001 Social Media Accounts T1586.002 Email Accounts T1586.003 Cloud Accounts", "order": 0}
{"chunk_id": "2a26668b-93ac-5ed0-af59-1c31160ed6e9", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may compromise email accounts that can be used during targeting. Adversaries can use compromised email accounts to further their operations, such as leveraging them to conduct Phishing for Information, Phishing, or large-scale spam email campaigns. Utilizing an existing persona with a compromised email account may engender a level of trust in a potential victim if they have a relationship with, or knowledge of, the compromised persona. Compromised email accounts can also be used in", "order": 1}
{"chunk_id": "fa411708-b1e8-5c5e-882e-f0ae02579c04", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "the acquisition of infrastructure (ex: Domains).", "order": 2}
{"chunk_id": "69033599-022b-5780-8087-f164151d3ff7", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "A variety of methods exist for compromising email accounts, such as gathering credentials via Phishing for Information, purchasing credentials from third-party sites, brute forcing credentials (ex: password reuse from breach credential dumps), or paying employees, suppliers or business partners for access to credentials.[1][2] Prior to compromising email accounts, adversaries may conduct Reconnaissance to inform decisions about which accounts to compromise to further their operation. Adversaries", "order": 3}
{"chunk_id": "452de865-14d9-5f3a-b4b6-ca05a854fcad", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "may target compromising well-known email accounts or domains from which malicious spam or Phishing emails may evade reputation-based email filtering rules.", "order": 4}
{"chunk_id": "8b6350a2-9a50-51ea-95c9-318e7bed1235", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries can use a compromised email account to hijack existing email threads with targets of interest. ID: T1586.002 Sub-technique of: T1586 Tactic: Resource Development Platforms: PRE Contributors: Bryan Onel; Tristan Bennett, Seamless Intelligence Version: 1.1 Created: 01 October 2020 Last Modified: 24 October 2025 Version Permalink Live Version Procedure Examples", "order": 5}
{"chunk_id": "0e250839-a4a6-5373-800f-72418ab30b99", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "ID Name Description G0007 APT28 APT28 has used compromised email accounts to send credential phishing emails. [3] G0016 APT29 APT29 has compromised email accounts to further enable phishing campaigns and taken control of dormant accounts. [4] [5] G1001 HEXANE HEXANE has used compromised accounts to send spearphishing emails. [6] G0136 IndigoZebra IndigoZebra has compromised legitimate email accounts to use in their spearphishing operations. [7]", "order": 6}
{"chunk_id": "0a380b42-902a-57cc-95ee-674c0104f340", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G0094 Kimsuky Kimsuky has compromised email accounts to send spearphishing e-mails. [8] [9] G1004 LAPSUS$ LAPSUS$ has payed employees, suppliers, and business partners of target organizations for credentials. [10] [11] G0065 Leviathan Leviathan has compromised email accounts to conduct social engineering attacks. [12] G0059 Magic Hound Magic Hound has compromised personal email accounts through the use of legitimate credentials and gathered additional victim information. [13]", "order": 7}
{"chunk_id": "8929e192-582e-578a-9d6d-53eea300ca44", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G0129 Mustang Panda Mustang Panda has compromised legitimate email accounts to use in their spear-phishing operations. [14] G0049 OilRig OilRig has compromised email accounts to send phishing emails. [15] C0059 Salesforce Data Exfiltration During Salesforce Data Exfiltration , threat actors used compromised emails to create Salesforce trial accounts. [16] G1033 Star Blizzard Star Blizzard has used compromised email accounts to conduct spearphishing against contacts of the original victim. [17]", "order": 8}
{"chunk_id": "51a04291-6b59-586b-82b5-dffef650e0b5", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "G1037 TA577 TA577 has sent thread hijacked messages from compromised emails. [18]", "order": 9}
{"chunk_id": "a6894d3f-c3c2-5e39-90fe-f612f7a65639", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Mitigations ID Mitigation Description M1056 Pre-compromise This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Detection Strategy", "order": 10}
{"chunk_id": "9840374c-1e7c-5618-978f-21392357cad3", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Analytic ID Analytic Description DET0861 Detection of Email Accounts AN1993 Much of this activity will take place outside the visibility of the target organization, making detection of this behavior difficult. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access (ex: Phishing ). References Bright, P. (2011, February 15). Anonymous speaks: the inside story of the HBGary hack. Retrieved March 9, 2017.", "order": 11}
{"chunk_id": "f2fb98b6-868f-595d-b704-71b8059f648f", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Microsoft. (2022, March 22). DEV-0537 criminal actor targeting organizations for data exfiltration and destruction. Retrieved March 23, 2022. Huntley, S. (2022, March 7). An update on the threat landscape. Retrieved March 16, 2022. ANSSI. (2021, December 6). PHISHING CAMPAIGNS BY THE NOBELIUM INTRUSION SET. Retrieved April 13, 2022. Douglas Bienstock. (2022, August 18). You Can’t Audit Me: APT29 Continues Targeting Microsoft 365. Retrieved February 23, 2023.", "order": 12}
{"chunk_id": "799afd1c-86c2-54c3-afc3-0675575a8338", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "SecureWorks 2019, August 27 LYCEUM Takes Center Stage in Middle East Campaign Retrieved. 2019/11/19 CheckPoint Research. (2021, July 1). IndigoZebra APT continues to attack Central Asia with evolving tools. Retrieved September 24, 2021. Kim, J. et al. (2019, October). KIMSUKY GROUP: TRACKING THE KING OF THE SPEAR PHISHING. Retrieved November 2, 2020. Jazi, H. (2021, June 1). Kimsuky APT continues to target South Korean government using AppleSeed backdoor. Retrieved June 10, 2021.", "order": 13}
{"chunk_id": "5a7ad735-96ab-5520-9775-91c9a68b9c48", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "MSTIC, DART, M365 Defender. (2022, March 24). DEV-0537 Criminal Actor Targeting Organizations for Data Exfiltration and Destruction. Retrieved May 17, 2022. Brown, D., et al. (2022, April 28). LAPSUS$: Recent techniques, tactics and procedures. Retrieved December 22, 2022. CISA. (2021, July 19). (AA21-200A) Joint Cybersecurity Advisory – Tactics, Techniques, and Procedures of Indicted APT40 Actors Associated with China’s MSS Hainan State Security Department. Retrieved August 12, 2021.", "order": 14}
{"chunk_id": "aade70be-a11e-5e3d-8f2c-89070daf06ac", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Wikoff, A. Emerson, R. (2020, July 16). New Research Exposes Iranian Threat Group Operations. Retrieved March 8, 2021. Nick Dai, Vickie Su, Sunny Lu. (2022, November 18). Earth Preta Spear-Phishing Governments Worldwide. Retrieved August 4, 2025. ClearSky Cybersecurity. (2017, January 5). Iranian Threat Agent OilRig Delivers Digitally Signed Malware, Impersonates University of Oxford. Retrieved May 3, 2017.", "order": 15}
{"chunk_id": "f5fcd94a-1694-51ef-985d-0832042e3b2b", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Google Threat Intelligence Group. (2025, June 4). The Cost of a Call: From Voice Phishing to Data Extortion. Retrieved October 22, 2025. CISA, et al. (2023, December 7). Russian FSB Cyber Actor Star Blizzard Continues Worldwide Spear-phishing Campaigns. Retrieved June 13, 2024. Proofpoint Threat Research and Team Cymru S2 Threat Research. (2024, April 4). Latrodectus: This Spider Bytes Like Ice . Retrieved May 31, 2024. Contact Us Terms of Use Privacy Policy Website Changelog", "order": 16}
{"chunk_id": "46a4350f-6a26-566f-96c6-e5ce523d3995", "doc_id": "978fcbf4-46ba-564e-a025-12dd2c311902", "filename": "T1586.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 17}
