{"chunk_id": "11a6683a-880f-5ddf-bbf1-98f4201d6a25", "doc_id": "3e61121a-84f8-5e6b-9fe0-851a0459c71d", "filename": "T1586.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Compromise Accounts Compromise Accounts Sub-techniques (3) ID Name T1586.001 Social Media Accounts T1586.002 Email Accounts T1586.003 Cloud Accounts", "order": 0}
{"chunk_id": "317156ce-75ab-507d-980b-61e90707fc49", "doc_id": "3e61121a-84f8-5e6b-9fe0-851a0459c71d", "filename": "T1586.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may compromise accounts with services that can be used during targeting. For operations incorporating social engineering, the utilization of an online persona may be important. Rather than creating and cultivating accounts (i.e. Establish Accounts), adversaries may compromise existing accounts. Utilizing an existing persona may engender a level of trust in a potential victim if they have a relationship, or knowledge of, the compromised persona.", "order": 1}
{"chunk_id": "5c19b640-9320-5030-b5af-278d8c06c7de", "doc_id": "3e61121a-84f8-5e6b-9fe0-851a0459c71d", "filename": "T1586.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "A variety of methods exist for compromising accounts, such as gathering credentials via Phishing for Information, purchasing credentials from third-party sites, brute forcing credentials (ex: password reuse from breach credential dumps), or paying employees, suppliers or business partners for access to credentials.[1][2] Prior to compromising accounts, adversaries may conduct Reconnaissance to inform decisions about which accounts to compromise to further their operation.", "order": 2}
{"chunk_id": "865c3ad3-5be4-55c7-abb4-1b5de1e853f1", "doc_id": "3e61121a-84f8-5e6b-9fe0-851a0459c71d", "filename": "T1586.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Personas may exist on a single site or across multiple sites (ex: Facebook, LinkedIn, Twitter, Google, etc.). Compromised accounts may require additional development, this could include filling out or modifying profile information, further developing social networks, or incorporating photos. Adversaries may directly leverage compromised email accounts for Phishing for Information or Phishing. ID: T1586 Sub-techniques: T1586.001, T1586.002, T1586.003 Tactic: Resource Development", "order": 3}
{"chunk_id": "293f1297-2609-566d-a499-45c40c222bfb", "doc_id": "3e61121a-84f8-5e6b-9fe0-851a0459c71d", "filename": "T1586.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Platforms: PRE Version: 1.2 Created: 01 October 2020 Last Modified: 24 October 2025 Version Permalink Live Version Mitigations ID Mitigation Description M1056 Pre-compromise This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Detection Strategy", "order": 4}
{"chunk_id": "c8f97ce6-ad33-5ec4-93e5-b5f8e0c1c87f", "doc_id": "3e61121a-84f8-5e6b-9fe0-851a0459c71d", "filename": "T1586.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "ID Name Analytic ID Analytic Description", "order": 5}
{"chunk_id": "228ce200-81c5-5426-b015-43f4859b80f7", "doc_id": "3e61121a-84f8-5e6b-9fe0-851a0459c71d", "filename": "T1586.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "DET0876 Detection of Compromise Accounts AN2008", "order": 6}
{"chunk_id": "5e08b50e-0fee-51d1-aa58-d91956bc033e", "doc_id": "3e61121a-84f8-5e6b-9fe0-851a0459c71d", "filename": "T1586.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Consider monitoring social media activity related to your organization. Suspicious activity may include personas claiming to work for your organization or recently modified accounts making numerous connection requests to accounts affiliated with your organization. Much of this activity will take place outside the visibility of the target organization, making detection of this behavior difficult. Detection efforts may be focused on related stages of the adversary", "order": 7}
{"chunk_id": "54550064-a21d-5f56-b025-6fd3aed6797d", "doc_id": "3e61121a-84f8-5e6b-9fe0-851a0459c71d", "filename": "T1586.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "lifecycle, such as during Initial Access (ex: Phishing ). Monitor and analyze traffic patterns and packet inspection associated to protocol(s) that do not follow the expected protocol standards and traffic flows (e.g extraneous packets that do not belong to established flows, gratuitous or anomalous traffic patterns, anomalous syntax, or structure). Consider correlation with process monitoring and command line to detect anomalous processes execution and command", "order": 8}
{"chunk_id": "d3af83e1-5baf-5077-831c-7f954b2b5292", "doc_id": "3e61121a-84f8-5e6b-9fe0-851a0459c71d", "filename": "T1586.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "line arguments associated to traffic patterns (e.g. monitor anomalies in use of files that do not normally initiate connections for respective protocol(s)).", "order": 9}
{"chunk_id": "0bf3742f-f542-5587-a4cf-076025b156da", "doc_id": "3e61121a-84f8-5e6b-9fe0-851a0459c71d", "filename": "T1586.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "References Bright, P. (2011, February 15). Anonymous speaks: the inside story of the HBGary hack. Retrieved March 9, 2017. Microsoft. (2022, March 22). DEV-0537 criminal actor targeting organizations for data exfiltration and destruction. Retrieved March 23, 2022. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 10}
