{"chunk_id": "83d99a8d-38cd-5b98-b6a4-6f1cf5958116", "doc_id": "bc0df37f-0921-5bbb-90b4-8da535769f17", "filename": "T1583.005.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Acquire Infrastructure Botnet Acquire Infrastructure: Botnet Other sub-techniques of Acquire Infrastructure (8) ID Name T1583.001 Domains T1583.002 DNS Server T1583.003 Virtual Private Server T1583.004 Server T1583.005 Botnet T1583.006 Web Services T1583.007 Serverless T1583.008 Malvertising", "order": 0}
{"chunk_id": "52f7755c-ca4d-5350-b61e-83855ee5213a", "doc_id": "bc0df37f-0921-5bbb-90b4-8da535769f17", "filename": "T1583.005.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may buy, lease, or rent a network of compromised systems that can be used during targeting. A botnet is a network of compromised systems that can be instructed to perform coordinated tasks.[1] Adversaries may purchase a subscription to use an existing botnet from a booter/stresser service.", "order": 1}
{"chunk_id": "5b8730fa-9f8a-5280-bdcf-445251e662b6", "doc_id": "bc0df37f-0921-5bbb-90b4-8da535769f17", "filename": "T1583.005.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Internet-facing edge devices and related network appliances that are end-of-life (EOL) and unsupported by their manufacturers are commonly acquired for botnet activities. Adversaries may lease operational relay box (ORB) networks – consisting of virtual private servers (VPS), small office/home office (SOHO) routers, or Internet of Things (IoT) devices – to serve as a botnet.[2]", "order": 2}
{"chunk_id": "170d7dcc-fba4-50f0-af0d-0afba58fffa4", "doc_id": "bc0df37f-0921-5bbb-90b4-8da535769f17", "filename": "T1583.005.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "With a botnet at their disposal, adversaries may perform follow-on activity such as large-scale Phishing or Distributed Denial of Service (DDoS).[3][4][5][6] Acquired botnets may also be used to support Command and Control activity, such as Hide Infrastructure through an established Proxy network. ID: T1583.005 Sub-technique of: T1583 Tactic: Resource Development Platforms: PRE Version: 1.2 Created: 01 October 2020 Last Modified: 24 October 2025 Version Permalink Live Version", "order": 3}
{"chunk_id": "acdad02b-2722-5e31-9ddd-5e710352fbea", "doc_id": "bc0df37f-0921-5bbb-90b4-8da535769f17", "filename": "T1583.005.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Procedure Examples ID Name Description G1023 APT5 APT5 has acquired a network of compromised systems – specifically an ORB (operational relay box) network – for follow on activities. [2] G0125 HAFNIUM HAFNIUM has incorporated leased devices into covert networks to obfuscate communications. [7] G0004 Ke3chang Ke3chang has utilized an ORB (operational relay box) network for reconnaissance and vulnerability exploitation. [2] Mitigations", "order": 4}
{"chunk_id": "9b82be81-3bfb-504f-b643-99f6c17325e6", "doc_id": "bc0df37f-0921-5bbb-90b4-8da535769f17", "filename": "T1583.005.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Mitigation Description M1056 Pre-compromise This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Detection Strategy", "order": 5}
{"chunk_id": "a5da5870-d57c-509e-8052-c00ad97487f3", "doc_id": "bc0df37f-0921-5bbb-90b4-8da535769f17", "filename": "T1583.005.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Analytic ID Analytic Description DET0837 Detection of Botnet AN1969 Much of this activity will take place outside the visibility of the target organization, making detection of this behavior difficult. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Phishing , Endpoint Denial of Service , or Network Denial of Service . References Norton. (n.d.). What is a botnet?. Retrieved October 4, 2020.", "order": 6}
{"chunk_id": "4ee8c3dc-40cf-5c5e-92e6-a8904a47e1fe", "doc_id": "bc0df37f-0921-5bbb-90b4-8da535769f17", "filename": "T1583.005.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Raggi, Michael. (2024, May 22). IOC Extinction? China-Nexus Cyber Espionage Actors Use ORB Networks to Raise Cost on Defenders. Retrieved July 8, 2024. Imperva. (n.d.). Booters, Stressers and DDoSers. Retrieved October 4, 2020. Brian Krebs. (2017, January 18). Who is Anna-Senpai, the Mirai Worm Author?. Retrieved May 15, 2017. Brian Krebs. (2016, October 31). Hackforums Shutters Booter Service Bazaar. Retrieved May 15, 2017.", "order": 7}
{"chunk_id": "b7bb750a-c839-50e7-b512-42df63a712ab", "doc_id": "bc0df37f-0921-5bbb-90b4-8da535769f17", "filename": "T1583.005.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Brian Krebs. (2016, October 27). Are the Days of “Booter” Services Numbered?. Retrieved May 15, 2017. Microsoft Threat Intelligence . (2025, March 5). Silk Typhoon targeting IT supply chain. Retrieved March 20, 2025. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 8}
