{"chunk_id": "5c0ba35e-b465-540b-9101-e88ea1b53beb", "doc_id": "7b0a8dad-c4bc-5109-ae49-0b3365e0a3f9", "filename": "T1595.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Active Scanning Wordlist Scanning Active Scanning: Wordlist Scanning Other sub-techniques of Active Scanning (3) ID Name T1595.001 Scanning IP Blocks T1595.002 Vulnerability Scanning T1595.003 Wordlist Scanning", "order": 0}
{"chunk_id": "40cf02f5-e95e-53c4-94c3-6406967ccb74", "doc_id": "7b0a8dad-c4bc-5109-ae49-0b3365e0a3f9", "filename": "T1595.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may iteratively probe infrastructure using brute-forcing and crawling techniques. While this technique employs similar methods to Brute Force, its goal is the identification of content and infrastructure rather than the discovery of valid credentials. Wordlists used in these scans may contain generic, commonly used names and file extensions or terms specific to a particular software. Adversaries may also create custom, target-specific wordlists using data gathered from other", "order": 1}
{"chunk_id": "4212e814-9d8d-50aa-b826-e8638b0c5fe5", "doc_id": "7b0a8dad-c4bc-5109-ae49-0b3365e0a3f9", "filename": "T1595.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Reconnaissance techniques (ex: Gather Victim Org Information, or Search Victim-Owned Websites).", "order": 2}
{"chunk_id": "5d046dc0-9941-50a6-bb35-8ca4a23801a3", "doc_id": "7b0a8dad-c4bc-5109-ae49-0b3365e0a3f9", "filename": "T1595.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "For example, adversaries may use web content discovery tools such as Dirb, DirBuster, and GoBuster and generic or custom wordlists to enumerate a website’s pages and directories.[1] This can help them to discover old, vulnerable pages or hidden administrative portals that could become the target of further operations (ex: Exploit Public-Facing Application or Brute Force).", "order": 3}
{"chunk_id": "d67bb5d8-d7e2-5823-864e-f803097eeb63", "doc_id": "7b0a8dad-c4bc-5109-ae49-0b3365e0a3f9", "filename": "T1595.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "As cloud storage solutions typically use globally unique names, adversaries may also use target-specific wordlists and tools such as s3recon and GCPBucketBrute to enumerate public and private buckets on cloud infrastructure.[2][3] Once storage objects are discovered, adversaries may leverage Data from Cloud Storage to access valuable information that can be exfiltrated or used to escalate privileges and move laterally. ID: T1595.003 Sub-technique of: T1595 Tactic: Reconnaissance", "order": 4}
{"chunk_id": "06a989b3-51df-50cf-b9d3-0bfe077d83bb", "doc_id": "7b0a8dad-c4bc-5109-ae49-0b3365e0a3f9", "filename": "T1595.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Platforms: PRE Contributors: Elvis Veliz, Citi; Jan Petrov, Citi; Richard Julian, Citi Version: 1.0 Created: 04 March 2022 Last Modified: 24 October 2025 Version Permalink Live Version Procedure Examples ID Name Description G0096 APT41 APT41 leverages various tools and frameworks to brute-force directories on web servers. [4] G0123 Volatile Cedar Volatile Cedar has used DirBuster and GoBuster to brute force web directories and DNS subdomains. [1] Mitigations", "order": 5}
{"chunk_id": "598cf963-5b7b-5c5d-ada6-0f2bd3862cb2", "doc_id": "7b0a8dad-c4bc-5109-ae49-0b3365e0a3f9", "filename": "T1595.003.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "ID Mitigation Description M1042 Disable or Remove Feature or Program Remove or disable access to any systems, resources, and infrastructure that are not explicitly required to be available externally. M1056 Pre-compromise This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.", "order": 6}
{"chunk_id": "ecbc600a-c291-526d-8075-4e5afd85cbae", "doc_id": "7b0a8dad-c4bc-5109-ae49-0b3365e0a3f9", "filename": "T1595.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Detection Strategy ID Name Analytic ID Analytic Description DET0868 Detection of Wordlist Scanning AN2000 Monitor for suspicious network traffic that could be indicative of scanning, such as large quantities originating from a single source (especially if the source is known to be associated with an adversary/botnet). References ClearSky Cyber Security. (2021, January). “Lebanese Cedar” APT Global Lebanese Espionage Campaign Leveraging Web Servers. Retrieved February 10, 2021.", "order": 7}
{"chunk_id": "687dcaec-79d3-52d2-88f7-64e88b952753", "doc_id": "7b0a8dad-c4bc-5109-ae49-0b3365e0a3f9", "filename": "T1595.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Travis Clarke. (2020, March 21). S3Recon GitHub. Retrieved March 4, 2022. Spencer Gietzen. (2019, February 26). Google Cloud Platform (GCP) Bucket Enumeration and Privilege Escalation. Retrieved March 4, 2022. Nikita Rostovcev. (2022, August 18). APT41 World Tour 2021 on a tight schedule. Retrieved February 22, 2024. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences", "order": 8}
{"chunk_id": "fec3cad8-e19c-5cb5-bee9-5dba7502d121", "doc_id": "7b0a8dad-c4bc-5109-ae49-0b3365e0a3f9", "filename": "T1595.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "© 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 9}
