{"chunk_id": "023d47dc-4a45-5c4c-ac68-9c9d1bb7d3fc", "doc_id": "3280fad4-bfd8-5469-98a7-e0db7f28d884", "filename": "T1593.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Search Open Websites/Domains Code Repositories Search Open Websites/Domains: Code Repositories Other sub-techniques of Search Open Websites/Domains (3) ID Name T1593.001 Social Media T1593.002 Search Engines T1593.003 Code Repositories", "order": 0}
{"chunk_id": "5a15d799-775d-535c-b6b9-bbcdd16b0b48", "doc_id": "3280fad4-bfd8-5469-98a7-e0db7f28d884", "filename": "T1593.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may search public code repositories for information about victims that can be used during targeting. Victims may store code in repositories on various third-party websites such as GitHub, GitLab, SourceForge, and BitBucket. Users typically interact with code repositories through a web application or command-line utilities such as git.", "order": 1}
{"chunk_id": "894ffcfe-4c52-523a-a3e0-8782ec9c8e50", "doc_id": "3280fad4-bfd8-5469-98a7-e0db7f28d884", "filename": "T1593.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may search various public code repositories for various information about a victim. Public code repositories can often be a source of various general information about victims, such as commonly used programming languages and libraries as well as the names of employees. Adversaries may also identify more sensitive data, including accidentally leaked credentials or API keys.[1] Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Phishing for", "order": 2}
{"chunk_id": "060bc47f-e7e6-5e99-ab0d-cf5e25e9d611", "doc_id": "3280fad4-bfd8-5469-98a7-e0db7f28d884", "filename": "T1593.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Information), establishing operational resources (ex: Compromise Accounts or Compromise Infrastructure), and/or initial access (ex: Valid Accounts or Phishing).", "order": 3}
{"chunk_id": "6164f2a7-51e0-5930-9849-eecec54006de", "doc_id": "3280fad4-bfd8-5469-98a7-e0db7f28d884", "filename": "T1593.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Note: This is distinct from Code Repositories, which focuses on Collection from private and internally hosted code repositories. ID: T1593.003 Sub-technique of: T1593 Tactic: Reconnaissance Platforms: PRE Contributors: Matt Burrough, @mattburrough, Microsoft; Vinayak Wadhwa, SAFE Security Version: 1.0 Created: 09 August 2022 Last Modified: 24 October 2025 Version Permalink Live Version Procedure Examples", "order": 4}
{"chunk_id": "7afcec19-7fd4-5223-b65f-17c3618638db", "doc_id": "3280fad4-bfd8-5469-98a7-e0db7f28d884", "filename": "T1593.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Description G1052 Contagious Interview Contagious Interview had identified and solicited victims through code repositories such as GitHub. [2] G0125 HAFNIUM HAFNIUM has discovered leaked corporate credentials on public repositories including GitHub. [3] G1004 LAPSUS$ LAPSUS$ has searched public code repositories for exposed credentials. [4] Mitigations", "order": 5}
{"chunk_id": "8d0673d2-1211-546a-977a-47c3e2c24399", "doc_id": "3280fad4-bfd8-5469-98a7-e0db7f28d884", "filename": "T1593.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Mitigation Description M1013 Application Developer Guidance Application developers uploading to public code repositories should be careful to avoid publishing sensitive information such as credentials and API keys. M1047 Audit Scan public code repositories for exposed credentials or other sensitive information before making commits. Ensure that any leaked credentials are removed from the commit history, not just the current latest version of the code. Detection Strategy", "order": 6}
{"chunk_id": "36e79eb4-7b70-5131-8d52-956b1246ff1e", "doc_id": "3280fad4-bfd8-5469-98a7-e0db7f28d884", "filename": "T1593.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Analytic ID Analytic Description DET0805 Detection of Code Repositories AN1937 Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access. References", "order": 7}
{"chunk_id": "66b221f6-ea0c-5034-921b-1d0fe3aa699e", "doc_id": "3280fad4-bfd8-5469-98a7-e0db7f28d884", "filename": "T1593.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Runa A. Sandvik. (2014, January 14). Attackers Scrape GitHub For Cloud Service Credentials, Hijack Account To Mine Virtual Currency. Retrieved August 9, 2022. Unit 42. (2023, November 21). Hacking Employers and Seeking Employment: Two Job-Related Campaigns Bear Hallmarks of North Korean Threat Actors. Retrieved October 17, 2025. Microsoft Threat Intelligence . (2025, March 5). Silk Typhoon targeting IT supply chain. Retrieved March 20, 2025.", "order": 8}
{"chunk_id": "dd9b0c87-16c0-5c5a-b709-314edc258964", "doc_id": "3280fad4-bfd8-5469-98a7-e0db7f28d884", "filename": "T1593.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "MSTIC, DART, M365 Defender. (2022, March 24). DEV-0537 Criminal Actor Targeting Organizations for Data Exfiltration and Destruction. Retrieved May 17, 2022. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 9}
