{"chunk_id": "4523b9e4-44c4-5933-b36c-4c626468fe85", "doc_id": "93e23883-7a20-5422-ad90-b9bd9c4bd24e", "filename": "T1596.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Search Open Technical Databases CDNs Search Open Technical Databases: CDNs Other sub-techniques of Search Open Technical Databases (5) ID Name T1596.001 DNS/Passive DNS T1596.002 WHOIS T1596.003 Digital Certificates T1596.004 CDNs T1596.005 Scan Databases", "order": 0}
{"chunk_id": "bc9a0178-8b55-576b-afa5-ad9df2c6513a", "doc_id": "93e23883-7a20-5422-ad90-b9bd9c4bd24e", "filename": "T1596.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may search content delivery network (CDN) data about victims that can be used during targeting. CDNs allow an organization to host content from a distributed, load balanced array of servers. CDNs may also allow organizations to customize content delivery based on the requestor’s geographical region.", "order": 1}
{"chunk_id": "78f29f6e-2e45-5807-85d6-2e4d1b1db17d", "doc_id": "93e23883-7a20-5422-ad90-b9bd9c4bd24e", "filename": "T1596.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may search CDN data to gather actionable information. Threat actors can use online resources and lookup tools to harvest information about content servers within a CDN. Adversaries may also seek and target CDN misconfigurations that leak sensitive information not intended to be hosted and/or do not have the same protection mechanisms (ex: login portals) as the content hosted on the organization’s website.[1] Information from these sources may reveal opportunities for other forms of", "order": 2}
{"chunk_id": "bf54bbf0-2b09-586f-9250-d554dbd30693", "doc_id": "93e23883-7a20-5422-ad90-b9bd9c4bd24e", "filename": "T1596.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "reconnaissance (ex: Active Scanning or Search Open Websites/Domains), establishing operational resources (ex: Acquire Infrastructure or Compromise Infrastructure), and/or initial access (ex: Drive-by Compromise).", "order": 3}
{"chunk_id": "7b8c2a61-9a27-5bbf-bf5a-09d36240361e", "doc_id": "93e23883-7a20-5422-ad90-b9bd9c4bd24e", "filename": "T1596.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID: T1596.004 Sub-technique of: T1596 Tactic: Reconnaissance Platforms: PRE Version: 1.0 Created: 02 October 2020 Last Modified: 24 October 2025 Version Permalink Live Version Mitigations", "order": 4}
{"chunk_id": "1cf0ec2b-aacd-503f-812a-e10431ab2c86", "doc_id": "93e23883-7a20-5422-ad90-b9bd9c4bd24e", "filename": "T1596.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Mitigation Description M1056 Pre-compromise This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties. Detection Strategy", "order": 5}
{"chunk_id": "a1b01ac3-db44-5794-bd2b-b78070237f44", "doc_id": "93e23883-7a20-5422-ad90-b9bd9c4bd24e", "filename": "T1596.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Analytic ID Analytic Description DET0809 Detection of CDNs AN1941 Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access. References", "order": 6}
{"chunk_id": "542fc0fb-91c6-5eb9-bc5d-a1a7c4eeb88f", "doc_id": "93e23883-7a20-5422-ad90-b9bd9c4bd24e", "filename": "T1596.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Swisscom & Digital Shadows. (2017, September 6). Content Delivery Networks (CDNs) Can Leave You Exposed – How You Might Be Affected And What You Can Do About It. Retrieved October 20, 2020. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 7}
