{"chunk_id": "b34d8e0d-5bcf-507e-a24a-583acf761a31", "doc_id": "5a18a745-bd76-5039-8d0f-ff16670a6125", "filename": "T1590.006.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Gather Victim Network Information Network Security Appliances Gather Victim Network Information: Network Security Appliances Other sub-techniques of Gather Victim Network Information (6) ID Name T1590.001 Domain Properties T1590.002 DNS T1590.003 Network Trust Dependencies T1590.004 Network Topology T1590.005 IP Addresses T1590.006 Network Security Appliances", "order": 0}
{"chunk_id": "39c5fb37-ddcd-52ae-bfd5-096ea546353d", "doc_id": "5a18a745-bd76-5039-8d0f-ff16670a6125", "filename": "T1590.006.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may gather information about the victim's network security appliances that can be used during targeting. Information about network security appliances may include a variety of details, such as the existence and specifics of deployed firewalls, content filters, and proxies/bastion hosts. Adversaries may also target information about victim network-based intrusion detection systems (NIDS) or other appliances related to defensive cybersecurity operations.", "order": 1}
{"chunk_id": "82ec2676-e4f3-5701-a05f-72141823d8d0", "doc_id": "5a18a745-bd76-5039-8d0f-ff16670a6125", "filename": "T1590.006.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may gather this information in various ways, such as direct collection actions via Active Scanning or Phishing for Information.[1] Information about network security appliances may also be exposed to adversaries via online or other accessible data sets (ex: Search Victim-Owned Websites). Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Technical Databases or Search Open Websites/Domains), establishing operational resources (ex:", "order": 2}
{"chunk_id": "3ae49830-75f6-592e-ab2c-6a63ae2ece87", "doc_id": "5a18a745-bd76-5039-8d0f-ff16670a6125", "filename": "T1590.006.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Develop Capabilities or Obtain Capabilities), and/or initial access (ex: External Remote Services).", "order": 3}
{"chunk_id": "4b53b5b0-747e-5dab-a879-a761f6929fe4", "doc_id": "5a18a745-bd76-5039-8d0f-ff16670a6125", "filename": "T1590.006.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID: T1590.006 Sub-technique of: T1590 Tactic: Reconnaissance Platforms: PRE Version: 1.0 Created: 02 October 2020 Last Modified: 24 October 2025 Version Permalink Live Version Procedure Examples ID Name Description G1017 Volt Typhoon Volt Typhoon has identified target network security measures as part of pre-compromise reconnaissance. [2] Mitigations", "order": 4}
{"chunk_id": "36135654-327c-5176-8375-6a1d66345d76", "doc_id": "5a18a745-bd76-5039-8d0f-ff16670a6125", "filename": "T1590.006.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Mitigation Description M1056 Pre-compromise This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties. Detection Strategy", "order": 5}
{"chunk_id": "d2ba83d1-1d85-524f-80d2-7e4c9106e016", "doc_id": "5a18a745-bd76-5039-8d0f-ff16670a6125", "filename": "T1590.006.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Analytic ID Analytic Description DET0889 Detection of Network Security Appliances AN2021 Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access. References", "order": 6}
{"chunk_id": "3a338d84-b2a8-51aa-a034-c8a98d407342", "doc_id": "5a18a745-bd76-5039-8d0f-ff16670a6125", "filename": "T1590.006.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Nmap. (n.d.). Chapter 10. Detecting and Subverting Firewalls and Intrusion Detection Systems. Retrieved October 20, 2020. CISA et al.. (2024, February 7). PRC State-Sponsored Actors Compromise and Maintain Persistent Access to U.S. Critical Infrastructure. Retrieved May 15, 2024. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 7}
