{"chunk_id": "fe5d1d0a-ab2d-56ed-a77f-ea9eb22c3473", "doc_id": "9c24386a-bcd8-50fd-8c97-abfec74f7db4", "filename": "T1591.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Gather Victim Org Information Identify Business Tempo Gather Victim Org Information: Identify Business Tempo Other sub-techniques of Gather Victim Org Information (4) ID Name T1591.001 Determine Physical Locations T1591.002 Business Relationships T1591.003 Identify Business Tempo T1591.004 Identify Roles", "order": 0}
{"chunk_id": "45534865-7089-5676-8a50-7fedaf201dc9", "doc_id": "9c24386a-bcd8-50fd-8c97-abfec74f7db4", "filename": "T1591.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may gather information about the victim's business tempo that can be used during targeting. Information about an organization’s business tempo may include a variety of details, including operational hours/days of the week. This information may also reveal times/dates of purchases and shipments of the victim’s hardware and software resources.", "order": 1}
{"chunk_id": "74e5b084-2c6e-5df9-8621-fc430a456a60", "doc_id": "9c24386a-bcd8-50fd-8c97-abfec74f7db4", "filename": "T1591.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may gather this information in various ways, such as direct elicitation via Phishing for Information. Information about business tempo may also be exposed to adversaries via online or other accessible data sets (ex: Social Media or Search Victim-Owned Websites).[1] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Websites/Domains), establishing operational resources (ex: Establish Accounts or Compromise", "order": 2}
{"chunk_id": "d5991f0b-bd77-58af-87e1-775da2076012", "doc_id": "9c24386a-bcd8-50fd-8c97-abfec74f7db4", "filename": "T1591.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Accounts), and/or initial access (ex: Supply Chain Compromise or Trusted Relationship)", "order": 3}
{"chunk_id": "125b049b-46e4-5b65-bab4-393cb6d24fbe", "doc_id": "9c24386a-bcd8-50fd-8c97-abfec74f7db4", "filename": "T1591.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID: T1591.003 Sub-technique of: T1591 Tactic: Reconnaissance Platforms: PRE Version: 1.0 Created: 02 October 2020 Last Modified: 24 October 2025 Version Permalink Live Version Mitigations", "order": 4}
{"chunk_id": "2f43bf25-960a-55f4-afc3-4dcb9a914aa0", "doc_id": "9c24386a-bcd8-50fd-8c97-abfec74f7db4", "filename": "T1591.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Mitigation Description M1056 Pre-compromise This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties. Detection Strategy", "order": 5}
{"chunk_id": "9d221dd2-5c3b-5246-a0fc-39e37a373636", "doc_id": "9c24386a-bcd8-50fd-8c97-abfec74f7db4", "filename": "T1591.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Analytic ID Analytic Description DET0849 Detection of Identify Business Tempo AN1981 Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access. References", "order": 6}
{"chunk_id": "1bbd8377-a6f9-500e-a7c3-0b3131e32298", "doc_id": "9c24386a-bcd8-50fd-8c97-abfec74f7db4", "filename": "T1591.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Seals, T. (2020, October 15). Broadvoice Leak Exposes 350M Records, Personal Voicemail Transcripts. Retrieved October 20, 2020. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 7}
