{"chunk_id": "9abfc5ef-3dc8-5a4c-bf4e-69f82b04461a", "doc_id": "0666f96c-a4f7-577f-9282-f032cb36af75", "filename": "T1597.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Search Closed Sources Search Closed Sources Sub-techniques (2) ID Name T1597.001 Threat Intel Vendors T1597.002 Purchase Technical Data", "order": 0}
{"chunk_id": "b21038c9-d0fd-594d-b9c0-de944fafd97b", "doc_id": "0666f96c-a4f7-577f-9282-f032cb36af75", "filename": "T1597.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may search and gather information about victims from closed (e.g., paid, private, or otherwise not freely available) sources that can be used during targeting. Information about victims may be available for purchase from reputable private sources and databases, such as paid subscriptions to feeds of technical/threat intelligence data. Adversaries may also purchase information from less-reputable sources such as dark web or cybercrime blackmarkets.[1]", "order": 1}
{"chunk_id": "3dc7c9e2-36f4-54e8-88ff-a2fe855e91c4", "doc_id": "0666f96c-a4f7-577f-9282-f032cb36af75", "filename": "T1597.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may search in different closed databases depending on what information they seek to gather. Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Websites/Domains), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: External Remote Services or Valid Accounts). ID: T1597 Sub-techniques: T1597.001, T1597.002 Tactic: Reconnaissance", "order": 2}
{"chunk_id": "f0c9ce7c-4dd4-5daf-8b22-60712471317a", "doc_id": "0666f96c-a4f7-577f-9282-f032cb36af75", "filename": "T1597.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Platforms: PRE Contributors: Barbara Louis-Sidney (OWN-CERT) Version: 1.1 Created: 02 October 2020 Last Modified: 24 October 2025 Version Permalink Live Version Procedure Examples ID Name Description G1011 EXOTIC LILY EXOTIC LILY has searched for information on targeted individuals on business databases including RocketReach and CrunchBase. [2] Mitigations", "order": 3}
{"chunk_id": "212a2e60-0a85-5dc2-b046-6aaff81d6311", "doc_id": "0666f96c-a4f7-577f-9282-f032cb36af75", "filename": "T1597.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Mitigation Description M1056 Pre-compromise This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties. Detection Strategy", "order": 4}
{"chunk_id": "16d68144-1d66-572f-9bf6-e8abe9bb48d2", "doc_id": "0666f96c-a4f7-577f-9282-f032cb36af75", "filename": "T1597.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Analytic ID Analytic Description DET0822 Detection of Search Closed Sources AN1954 Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access. References", "order": 5}
{"chunk_id": "f49b5a97-deeb-5652-a0f2-04208bc8c827", "doc_id": "0666f96c-a4f7-577f-9282-f032cb36af75", "filename": "T1597.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Cimpanu, C. (2020, May 9). A hacker group is selling more than 73 million user records on the dark web. Retrieved October 20, 2020. Stolyarov, V. (2022, March 17). Exposing initial access broker with ties to Conti. Retrieved August 18, 2022. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 6}
