{"chunk_id": "94f9cf1e-f7fc-541d-b5a5-f0cff019ed5b", "doc_id": "9f70b173-5ec6-54b2-81cd-ad60492af3bb", "filename": "T1592.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Gather Victim Host Information Firmware Gather Victim Host Information: Firmware Other sub-techniques of Gather Victim Host Information (4) ID Name T1592.001 Hardware T1592.002 Software T1592.003 Firmware T1592.004 Client Configurations", "order": 0}
{"chunk_id": "ee08af9e-9de3-5171-9b87-3b7f136220cc", "doc_id": "9f70b173-5ec6-54b2-81cd-ad60492af3bb", "filename": "T1592.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may gather information about the victim's host firmware that can be used during targeting. Information about host firmware may include a variety of details such as type and versions on specific hosts, which may be used to infer more information about hosts in the environment (ex: configuration, purpose, age/patch level, etc.).", "order": 1}
{"chunk_id": "acd7ec3c-4617-5228-8a60-8951fd3ae3ac", "doc_id": "9f70b173-5ec6-54b2-81cd-ad60492af3bb", "filename": "T1592.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may gather this information in various ways, such as direct elicitation via Phishing for Information. Information about host firmware may only be exposed to adversaries via online or other accessible data sets (ex: job postings, network maps, assessment reports, resumes, or purchase invoices).[1] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Websites/Domains or Search Open Technical Databases), establishing operational", "order": 2}
{"chunk_id": "391cb23c-86f8-54ff-8728-18078d34a564", "doc_id": "9f70b173-5ec6-54b2-81cd-ad60492af3bb", "filename": "T1592.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: Supply Chain Compromise or Exploit Public-Facing Application).", "order": 3}
{"chunk_id": "f38689f2-e09f-5033-9189-d1a42e79c0f7", "doc_id": "9f70b173-5ec6-54b2-81cd-ad60492af3bb", "filename": "T1592.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID: T1592.003 Sub-technique of: T1592 Tactic: Reconnaissance Platforms: PRE Version: 1.0 Created: 02 October 2020 Last Modified: 24 October 2025 Version Permalink Live Version Mitigations", "order": 4}
{"chunk_id": "65e0a713-c1d5-5c09-9b94-0283f90e5d04", "doc_id": "9f70b173-5ec6-54b2-81cd-ad60492af3bb", "filename": "T1592.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Mitigation Description M1056 Pre-compromise This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties. Detection Strategy", "order": 5}
{"chunk_id": "93a6ce15-a8dc-54a9-a1e0-9b44b915f5ea", "doc_id": "9f70b173-5ec6-54b2-81cd-ad60492af3bb", "filename": "T1592.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Analytic ID Analytic Description DET0818 Detection of Firmware AN1950 Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access. References", "order": 6}
{"chunk_id": "ea95dae2-a325-5ff3-aa01-61ce12d72771", "doc_id": "9f70b173-5ec6-54b2-81cd-ad60492af3bb", "filename": "T1592.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Goodin, D. & Salter, J. (2020, August 6). More than 20GB of Intel source code and proprietary data dumped online. Retrieved October 20, 2020. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 7}
