{"chunk_id": "122ff147-0eb3-5b9e-b301-19f31cd8ac91", "doc_id": "df53d450-c9f2-5227-942a-b286fe19f1b4", "filename": "T1598.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Phishing for Information Spearphishing Voice Phishing for Information: Spearphishing Voice Other sub-techniques of Phishing for Information (4) ID Name T1598.001 Spearphishing Service T1598.002 Spearphishing Attachment T1598.003 Spearphishing Link T1598.004 Spearphishing Voice", "order": 0}
{"chunk_id": "022ee99b-7acb-514a-81f9-f3e0711c3f56", "doc_id": "df53d450-c9f2-5227-942a-b286fe19f1b4", "filename": "T1598.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may use voice communications to elicit sensitive information that can be used during targeting. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Spearphishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Impersonation) and/or creating a sense of urgency or alarm for the recipient.", "order": 1}
{"chunk_id": "a1fe3d25-e481-595e-8496-9766b27fb23c", "doc_id": "df53d450-c9f2-5227-942a-b286fe19f1b4", "filename": "T1598.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "All forms of phishing are electronically delivered social engineering. In this scenario, adversaries use phone calls to elicit sensitive information from victims. Known as voice phishing (or \"vishing\"), these communications can be manually executed by adversaries, hired call centers, or even automated via robocalls. Voice phishers may spoof their phone number while also posing as a trusted entity, such as a business partner or technical support staff.[1]", "order": 2}
{"chunk_id": "74054fb3-1642-5017-849b-4155181afb79", "doc_id": "df53d450-c9f2-5227-942a-b286fe19f1b4", "filename": "T1598.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Victims may also receive phishing messages that direct them to call a phone number (\"callback phishing\") where the adversary attempts to collect confidential information.[2] Adversaries may also use information from previous reconnaissance efforts (ex: Search Open Websites/Domains or Search Victim-Owned Websites) to tailor pretexts to be even more persuasive and believable for the victim. ID: T1598.004 Sub-technique of: T1598 Tactic: Reconnaissance Platforms: PRE Version: 1.0", "order": 3}
{"chunk_id": "62ae22a1-0fb2-51d9-a0e0-e622f258b10a", "doc_id": "df53d450-c9f2-5227-942a-b286fe19f1b4", "filename": "T1598.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Created: 07 September 2023 Last Modified: 15 April 2025 Version Permalink Live Version Procedure Examples", "order": 4}
{"chunk_id": "f280622b-16f3-5683-9b60-7ef5a63da930", "doc_id": "df53d450-c9f2-5227-942a-b286fe19f1b4", "filename": "T1598.004.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "ID Name Description C0027 C0027 During C0027 , Scattered Spider used phone calls to instruct victims to navigate to credential-harvesting websites. [3] G1004 LAPSUS$ LAPSUS$ has called victims' help desk to convince the support personnel to reset a privileged account’s credentials. [4]", "order": 5}
{"chunk_id": "3070355e-7e40-56f5-b0c7-b7f4a25c7cbd", "doc_id": "df53d450-c9f2-5227-942a-b286fe19f1b4", "filename": "T1598.004.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "C0059 Salesforce Data Exfiltration During Salesforce Data Exfiltration , threat actors initiated voice calls with victims to socially engineer them into authorizing malicious applications or divulging sensitive credentials. [5] [6] G1015 Scattered Spider Scattered Spider has used help desk voice-based phishing and also called employees at target organizations and compelled them to navigate to fake login portals using adversary-in-the-middle toolkits. [7] [8] [9]", "order": 6}
{"chunk_id": "06bae829-4280-5636-9917-e170c97fbcc8", "doc_id": "df53d450-c9f2-5227-942a-b286fe19f1b4", "filename": "T1598.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Mitigations ID Mitigation Description M1017 User Training Users can be trained to identify and report social engineering techniques and spearphishing attempts, while also being suspicious of and verifying the identify of callers. [10] Detection Strategy ID Name Analytic ID Analytic Description DET0886 Detection of Spearphishing Voice AN2018 Monitor call logs from corporate devices to identify patterns of potential voice phishing, such as calls to/from known malicious phone numbers.", "order": 7}
{"chunk_id": "fe005699-44fd-56f2-9ddc-3903ed3e6ac5", "doc_id": "df53d450-c9f2-5227-942a-b286fe19f1b4", "filename": "T1598.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "References Bank of America. (n.d.). How to avoid telephone scams. Retrieved September 8, 2023. Avertium. (n.d.). EVERYTHING YOU NEED TO KNOW ABOUT CALLBACK PHISHING. Retrieved February 2, 2023. Parisi, T. (2022, December 2). Not a SIMulation: CrowdStrike Investigations Reveal Intrusion Campaign Targeting Telco and BPO Companies. Retrieved June 30, 2023.", "order": 8}
{"chunk_id": "57118407-4881-5354-be26-1e3460f3fb42", "doc_id": "df53d450-c9f2-5227-942a-b286fe19f1b4", "filename": "T1598.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "MSTIC, DART, M365 Defender. (2022, March 24). DEV-0537 Criminal Actor Targeting Organizations for Data Exfiltration and Destruction. Retrieved May 17, 2022. FBI Cyber Division. (2025, September 12). Cyber Criminal Groups UNC6040 and UNC6395 Compromising Salesforce Instances for Data Theft and Extortion. Retrieved October 22, 2025. Google Threat Intelligence Group. (2025, June 4). The Cost of a Call: From Voice Phishing to Data Extortion. Retrieved October 22, 2025.", "order": 9}
{"chunk_id": "1f4cdf6d-88e9-566f-b1d2-5e109c62cd51", "doc_id": "df53d450-c9f2-5227-942a-b286fe19f1b4", "filename": "T1598.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Microsoft. (2023, October 25). Octo Tempest crosses boundaries to facilitate extortion, encryption, and destruction. Retrieved March 18, 2024. Counter Adversary Operations. (2025, July 2). CrowdStrike Services Observes SCATTERED SPIDER Escalate Attacks Across Industries. Retrieved October 13, 2025. Mandiant Incident Response. (2025, July 23). From Help Desk to Hypervisor: Defending Your VMware vSphere Estate from UNC3944. Retrieved October 13, 2025.", "order": 10}
{"chunk_id": "50950c78-1817-5937-b1f7-05d1c1364777", "doc_id": "df53d450-c9f2-5227-942a-b286fe19f1b4", "filename": "T1598.004.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "CISA. (2021, February 1). Avoiding Social Engineering and Phishing Attacks. Retrieved September 8, 2023. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 11}
