{"chunk_id": "618aa566-0c19-5ae9-a711-707863ed8164", "doc_id": "7bca0b2d-8253-5467-a0df-00cd89f98e47", "filename": "T1597.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Search Closed Sources Threat Intel Vendors Search Closed Sources: Threat Intel Vendors Other sub-techniques of Search Closed Sources (2) ID Name T1597.001 Threat Intel Vendors T1597.002 Purchase Technical Data", "order": 0}
{"chunk_id": "204324f2-c15a-533e-a95c-6a0ea8d51fce", "doc_id": "7bca0b2d-8253-5467-a0df-00cd89f98e47", "filename": "T1597.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may search private data from threat intelligence vendors for information that can be used during targeting. Threat intelligence vendors may offer paid feeds or portals that offer more data than what is publicly reported. Although sensitive details (such as customer names and other identifiers) may be redacted, this information may contain trends regarding breaches such as target industries, attribution claims, and successful TTPs/countermeasures.[1]", "order": 1}
{"chunk_id": "5f3bf66e-be91-58bb-a47c-1ca96c6dcc30", "doc_id": "7bca0b2d-8253-5467-a0df-00cd89f98e47", "filename": "T1597.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may search in private threat intelligence vendor data to gather actionable information. If a threat actor is searching for information on their own activities, that falls under Search Threat Vendor Data. Information reported by vendors may also reveal opportunities other forms of reconnaissance (ex: Search Open Websites/Domains), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: Exploit Public-Facing Application or", "order": 2}
{"chunk_id": "1a019f7b-6094-51bf-8ad5-ea75ef4cfd9c", "doc_id": "7bca0b2d-8253-5467-a0df-00cd89f98e47", "filename": "T1597.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "External Remote Services).", "order": 3}
{"chunk_id": "cccb1651-b945-541a-a6c7-4df7393948ee", "doc_id": "7bca0b2d-8253-5467-a0df-00cd89f98e47", "filename": "T1597.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID: T1597.001 Sub-technique of: T1597 Tactic: Reconnaissance Platforms: PRE Version: 2.0 Created: 02 October 2020 Last Modified: 24 October 2025 Version Permalink Live Version Mitigations", "order": 4}
{"chunk_id": "eca8d52a-7a16-5649-bf75-1927487b524c", "doc_id": "7bca0b2d-8253-5467-a0df-00cd89f98e47", "filename": "T1597.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Mitigation Description M1056 Pre-compromise This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties. Detection Strategy", "order": 5}
{"chunk_id": "cecd69f4-597e-5da9-adce-e748805ccd46", "doc_id": "7bca0b2d-8253-5467-a0df-00cd89f98e47", "filename": "T1597.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Analytic ID Analytic Description DET0816 Detection of Threat Intel Vendors AN1948 Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access. References", "order": 6}
{"chunk_id": "2ad94e1f-72f2-50af-83f1-93c5e1786970", "doc_id": "7bca0b2d-8253-5467-a0df-00cd89f98e47", "filename": "T1597.001.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Banerd, W. (2019, April 30). 10 of the Best Open Source Threat Intelligence Feeds. Retrieved October 20, 2020. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 7}
