{"chunk_id": "21fb44cb-d68e-524f-ad7b-20e2813a9aeb", "doc_id": "77642277-29ef-514d-bf39-72a2d3c5fc3d", "filename": "T1597.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Search Closed Sources Purchase Technical Data Search Closed Sources: Purchase Technical Data Other sub-techniques of Search Closed Sources (2) ID Name T1597.001 Threat Intel Vendors T1597.002 Purchase Technical Data", "order": 0}
{"chunk_id": "726a205e-01a2-5a1c-b8fd-0662e8a1bb6d", "doc_id": "77642277-29ef-514d-bf39-72a2d3c5fc3d", "filename": "T1597.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may purchase technical information about victims that can be used during targeting. Information about victims may be available for purchase within reputable private sources and databases, such as paid subscriptions to feeds of scan databases or other data aggregation services. Adversaries may also purchase information from less-reputable sources such as dark web or cybercrime blackmarkets.", "order": 1}
{"chunk_id": "d7348f5b-7a34-536f-941f-339ce3c4405c", "doc_id": "77642277-29ef-514d-bf39-72a2d3c5fc3d", "filename": "T1597.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may purchase information about their already identified targets, or use purchased data to discover opportunities for successful breaches. Threat actors may gather various technical details from purchased data, including but not limited to employee contact information, credentials, or specifics regarding a victim’s infrastructure.[1] Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Websites/Domains),", "order": 2}
{"chunk_id": "19798ec6-6069-5573-873e-2454c3a3916b", "doc_id": "77642277-29ef-514d-bf39-72a2d3c5fc3d", "filename": "T1597.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: External Remote Services or Valid Accounts).", "order": 3}
{"chunk_id": "018facb2-df0c-5947-b1ea-4df1cb563dc2", "doc_id": "77642277-29ef-514d-bf39-72a2d3c5fc3d", "filename": "T1597.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID: T1597.002 Sub-technique of: T1597 Tactic: Reconnaissance Platforms: PRE Version: 1.0 Created: 02 October 2020 Last Modified: 24 October 2025 Version Permalink Live Version Procedure Examples ID Name Description G1004 LAPSUS$ LAPSUS$ has purchased credentials and session tokens from criminal underground forums. [2] Mitigations", "order": 4}
{"chunk_id": "acc128e7-3eb3-5d41-8130-7099e4eb063a", "doc_id": "77642277-29ef-514d-bf39-72a2d3c5fc3d", "filename": "T1597.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Mitigation Description M1056 Pre-compromise This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties. Detection Strategy", "order": 5}
{"chunk_id": "1a1914ec-8a41-55a9-ab5e-2960807d1e5b", "doc_id": "77642277-29ef-514d-bf39-72a2d3c5fc3d", "filename": "T1597.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Analytic ID Analytic Description DET0880 Detection of Purchase Technical Data AN2012 Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access. References", "order": 6}
{"chunk_id": "51f4d7c7-b679-5ed7-a600-7b1be9a82010", "doc_id": "77642277-29ef-514d-bf39-72a2d3c5fc3d", "filename": "T1597.002.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Cimpanu, C. (2020, May 9). A hacker group is selling more than 73 million user records on the dark web. Retrieved October 20, 2020. MSTIC, DART, M365 Defender. (2022, March 24). DEV-0537 Criminal Actor Targeting Organizations for Data Exfiltration and Destruction. Retrieved May 17, 2022. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 7}
