{"chunk_id": "6c42b860-c767-5f59-a304-c9f52153f7da", "doc_id": "76bcdbd8-8ac2-5d74-8e51-4b347230a40b", "filename": "T1596.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Search Open Technical Databases Digital Certificates Search Open Technical Databases: Digital Certificates Other sub-techniques of Search Open Technical Databases (5) ID Name T1596.001 DNS/Passive DNS T1596.002 WHOIS T1596.003 Digital Certificates T1596.004 CDNs T1596.005 Scan Databases", "order": 0}
{"chunk_id": "cf4205d1-3a15-560b-b4e3-ee935f1f68c6", "doc_id": "76bcdbd8-8ac2-5d74-8e51-4b347230a40b", "filename": "T1596.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may search public digital certificate data for information about victims that can be used during targeting. Digital certificates are issued by a certificate authority (CA) in order to cryptographically verify the origin of signed content. These certificates, such as those used for encrypted web traffic (HTTPS SSL/TLS communications), contain information about the registered organization such as name and location.", "order": 1}
{"chunk_id": "7ca68010-d4d8-5751-88c8-b69de92e336f", "doc_id": "76bcdbd8-8ac2-5d74-8e51-4b347230a40b", "filename": "T1596.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Adversaries may search digital certificate data to gather actionable information. Threat actors can use online resources and lookup tools to harvest information about certificates.[1] Digital certificate data may also be available from artifacts signed by the organization (ex: certificates used from encrypted web traffic are served with content).[2] Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Active Scanning or Phishing for Information),", "order": 2}
{"chunk_id": "f85e4e6b-0804-5188-9577-1958c08293e4", "doc_id": "76bcdbd8-8ac2-5d74-8e51-4b347230a40b", "filename": "T1596.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: External Remote Services or Trusted Relationship).", "order": 3}
{"chunk_id": "c93c313a-0b92-576b-974c-108fffcc3934", "doc_id": "76bcdbd8-8ac2-5d74-8e51-4b347230a40b", "filename": "T1596.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID: T1596.003 Sub-technique of: T1596 Tactic: Reconnaissance Platforms: PRE Version: 1.0 Created: 02 October 2020 Last Modified: 24 October 2025 Version Permalink Live Version Mitigations", "order": 4}
{"chunk_id": "cdb32e6f-865c-56a3-a04f-e7a5ae7c7548", "doc_id": "76bcdbd8-8ac2-5d74-8e51-4b347230a40b", "filename": "T1596.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Mitigation Description M1056 Pre-compromise This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties. Detection Strategy", "order": 5}
{"chunk_id": "2cd1e30e-8217-5c86-96c6-88fa378e841b", "doc_id": "76bcdbd8-8ac2-5d74-8e51-4b347230a40b", "filename": "T1596.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Analytic ID Analytic Description DET0831 Detection of Digital Certificates AN1963 Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access. References SSL Shopper. (n.d.). SSL Checker. Retrieved October 20, 2020.", "order": 6}
{"chunk_id": "070e3f73-6865-5fa7-a6f9-5507edc157f4", "doc_id": "76bcdbd8-8ac2-5d74-8e51-4b347230a40b", "filename": "T1596.003.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Jain, M. (2019, September 16). Export & Download — SSL Certificate from Server (Site URL). Retrieved October 20, 2020. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 7}
