{"chunk_id": "a7104686-3e9d-5e4e-9fdc-e3b8654555bb", "doc_id": "b591bb84-cea9-5ea4-bfc9-1d8f853fcbcb", "filename": "T1650.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Techniques Enterprise Acquire Access Acquire Access Adversaries may purchase or otherwise acquire an existing access to a target system or network. A variety of online services and initial access broker networks are available to sell access to previously compromised systems.[1][2][3] In some cases, adversary groups may form partnerships to share compromised systems with each other.[4]", "order": 0}
{"chunk_id": "905712f8-33ec-519c-b49c-a6b26b09a533", "doc_id": "b591bb84-cea9-5ea4-bfc9-1d8f853fcbcb", "filename": "T1650.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Footholds to compromised systems may take a variety of forms, such as access to planted backdoors (e.g., Web Shell) or established access via External Remote Services. In some cases, access brokers will implant compromised systems with a \"load\" that can be used to install additional malware for paying customers.[1]", "order": 1}
{"chunk_id": "ed1f4358-035d-5fcb-90a3-13af6eb2d10a", "doc_id": "b591bb84-cea9-5ea4-bfc9-1d8f853fcbcb", "filename": "T1650.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "By leveraging existing access broker networks rather than developing or obtaining their own initial access capabilities, an adversary can potentially reduce the resources required to gain a foothold on a target network and focus their efforts on later stages of compromise. Adversaries may prioritize acquiring access to systems that have been determined to lack security monitoring or that have high privileges, or systems that belong to organizations in a particular sector.[1][2]", "order": 2}
{"chunk_id": "5ae6a6ae-459e-5dab-a38e-562fba8f0e99", "doc_id": "b591bb84-cea9-5ea4-bfc9-1d8f853fcbcb", "filename": "T1650.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "In some cases, purchasing access to an organization in sectors such as IT contracting, software development, or telecommunications may allow an adversary to compromise additional victims via a Trusted Relationship, Multi-Factor Authentication Interception, or even Supply Chain Compromise.", "order": 3}
{"chunk_id": "9a3a38ab-80a5-5739-a9ba-92e053127e27", "doc_id": "b591bb84-cea9-5ea4-bfc9-1d8f853fcbcb", "filename": "T1650.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Note: while this technique is distinct from other behaviors such as Purchase Technical Data and Credentials, they may often be used in conjunction (especially where the acquired foothold requires Valid Accounts). ID: T1650 Sub-techniques: No sub-techniques Tactic: Resource Development Platforms: PRE Contributors: Jeffrey Barto; Jeremy Kennelly Version: 1.0 Created: 10 March 2023 Last Modified: 24 October 2025 Version Permalink Live Version Procedure Examples", "order": 4}
{"chunk_id": "29bc4769-4928-5c42-8221-3b3723df7d34", "doc_id": "b591bb84-cea9-5ea4-bfc9-1d8f853fcbcb", "filename": "T1650.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Description G1051 Medusa Group Medusa Group has purchased user credentials and other sensitive data from Initial Access Brokers (IABs). [5] [6] [7] [8] Mitigations ID Mitigation Description M1056 Pre-compromise This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Detection Strategy", "order": 5}
{"chunk_id": "b6034edc-afa7-5c78-bd18-cd4313b09462", "doc_id": "b591bb84-cea9-5ea4-bfc9-1d8f853fcbcb", "filename": "T1650.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID Name Analytic ID Analytic Description DET0884 Detection of Acquire Access AN2016 Much of this takes place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access. References Microsoft. (2022, May 9). Ransomware as a service: Understanding the cybercrime gig economy and how to protect yourself. Retrieved March 10, 2023.", "order": 6}
{"chunk_id": "44291352-75ef-5e65-8dca-998410e6c1d8", "doc_id": "b591bb84-cea9-5ea4-bfc9-1d8f853fcbcb", "filename": "T1650.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "CrowdStrike Intelligence Team. (2022, February 23). Access Brokers: Who Are the Targets, and What Are They Worth?. Retrieved March 10, 2023. Brian Krebs. (2012, October 22). Service Sells Access to Fortune 500 Firms. Retrieved March 10, 2023. Cybersecurity Infrastructure and Defense Agency. (2022, June 2). Karakurt Data Extortion Group. Retrieved March 10, 2023. Anthony Galiette, Doel Santos. (2024, January 11). Medusa Ransomware Turning Your Files into Stone. Retrieved October 15, 2025.", "order": 7}
{"chunk_id": "a91225d8-fd40-5784-a3c2-df3f2fdaea7f", "doc_id": "b591bb84-cea9-5ea4-bfc9-1d8f853fcbcb", "filename": "T1650.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Check Point. (2025, April 16). The 2025 Ransomware Surge: Context for Medusa’s Rise. Retrieved October 15, 2025. Cybersecurity and Infrastructure Security Agency. (2025, March 12). AA25-071A #StopRansomware: Medusa Ransomware. Retrieved October 15, 2025. Intel471. (2025, May 14). Threat hunting case study: Medusa ransomware. Retrieved October 15, 2025. Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences", "order": 8}
{"chunk_id": "24d954f1-c105-5697-9df5-f900ec1ab011", "doc_id": "b591bb84-cea9-5ea4-bfc9-1d8f853fcbcb", "filename": "T1650.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "© 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 9}
