{"chunk_id": "c9c765e4-bad6-5ddc-a218-a82474f6bb66", "doc_id": "5f00893c-0434-5c3a-a66d-4d518fcc290e", "filename": "cyberframework.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Skip to main content U.S. flag An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( ) or https:// means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites. https://www.nist.gov/cyberframework National Institute of Standards and Technology", "order": 0}
{"chunk_id": "cb3b9795-8ea7-57c8-81c9-6958bcca3bb7", "doc_id": "5f00893c-0434-5c3a-a66d-4d518fcc290e", "filename": "cyberframework.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "National Institute of Standards and Technology Cybersecurity Framework Helping organizations to better understand and improve their management of cybersecurity risk Connect with us X (Twitter) CSF 2.0 For industry, government, and organizations to reduce cybersecurity risks Read the Document Top Blue Winding Road Quick Start Guides For users with specific common goals View the Quick Start Guides CSF 2.0 Profiles Templates and useful resources for creating and using both CSF profiles", "order": 1}
{"chunk_id": "3cccc8cb-0051-5a62-8bb9-3420daaf17c0", "doc_id": "5f00893c-0434-5c3a-a66d-4d518fcc290e", "filename": "cyberframework.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "See the Profiles Bottom Road Winding Blue Informative References (Mappings) See how NIST's resources overlap and share themes See the Mappings Videos The NIST CSF 2.0 The NIST CSF 2.0 See more Videos CSF 2.0 Webinar Series: Implementing CSF 2.0—The Why, What, and How CSF 2.0 Webinar Series: Implementing CSF 2.0—The Why, What, and How Latest Updates", "order": 2}
{"chunk_id": "a7d44cbd-de8f-5fd5-889f-199087769df4", "doc_id": "5f00893c-0434-5c3a-a66d-4d518fcc290e", "filename": "cyberframework.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Seeking comments through November 17, 2025: The NIST Internal Report (IR) 8183 Revision 2, Cybersecurity Framework Version 2.0 Manufacturing Profile. The Profile is structured around the NIST CSF 2.0 Functions: Govern, Identify, Protect, Detect, Respond, and Recover. These Functions form the basis for prioritizing cybersecurity outcomes tailored to the manufacturing sector, enabling manufacturers to align their cybersecurity efforts with business needs, risk tolerance, and available resources.", "order": 3}
{"chunk_id": "82cb4476-f06e-5b1a-a1f1-3e012b2556b8", "doc_id": "5f00893c-0434-5c3a-a66d-4d518fcc290e", "filename": "cyberframework.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "On September 18, 2025, a mapping between CSF 2.0 and NIST SP 800-171 Rev. 3 was posted to the NIST OLIR (Online Informative References) catalog. On July 25, 2025, NIST launched the CSF 2.0 Resources page to list publicly available resources submitted by the CSF 2.0 user community. Resource topics include educational materials, examples of use, tools, and informative references. Visit the CSF 2.0 Resources page to learn more about evaluation criteria and how you can submit a resource.", "order": 4}
{"chunk_id": "c5945c8b-2965-5ceb-9ce9-db9b1ca8712e", "doc_id": "5f00893c-0434-5c3a-a66d-4d518fcc290e", "filename": "cyberframework.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "On July 18, 2025, NIST published a mapping of the Cybersecurity Framework (CSF) 2.0 to Protecting Controlled Unclassified Information in Nonfederal Systems and Organizations (800 171 Rev. 3) (status: draft) to our Online Informative References (OLIR) catalog. The mapping is between functions and categories in the CSF 2.0 and the NIST SP 800-171 Rev. 3 Controlled Unclassified Information (CUI) requirements.", "order": 5}
{"chunk_id": "70af2a42-8db6-50f5-a552-e7cea92f823b", "doc_id": "5f00893c-0434-5c3a-a66d-4d518fcc290e", "filename": "cyberframework.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "On May 30, 2025, ISO/IEC-27001:2022-to-Cybersecurity-Framework-v2.0 Informative Reference Details (status: final) was posted to the NIST OLIR (Online Informative References) catalog. See more Latest Updates Contacts For further information and/or questions about the Cybersecurity Framework CONTACT: [email protected] Was this page helpful? National Institute of Standards and Technology logo HEADQUARTERS 100 Bureau Drive Gaithersburg, MD 20899 301-975-2000", "order": 6}
{"chunk_id": "d4dec036-2ca8-5653-a2c4-a7d342c9b2f9", "doc_id": "5f00893c-0434-5c3a-a66d-4d518fcc290e", "filename": "cyberframework.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Webmaster | Contact Us | Our Other Offices X.com Facebook LinkedIn Instagram YouTube Giphy RSS Feed Mailing List How are we doing? Feedback Site Privacy Accessibility Privacy Program Copyrights Vulnerability Disclosure No Fear Act Policy FOIA Environmental Policy Scientific Integrity Information Quality Standards Commerce.gov Science.gov USA.gov Vote.gov", "order": 7}
