{"chunk_id": "5567afbe-1c1a-5421-8caf-2dcf2b8f07ae", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ATT&CK v18 has been released! Check out the blog post or changelog for more information. Home Tactics Enterprise Reconnaissance Reconnaissance The adversary is trying to gather information they can use to plan future operations.", "order": 0}
{"chunk_id": "6d24dbd6-4f4f-5c0c-aa98-55dc11d9fb34", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Reconnaissance consists of techniques that involve adversaries actively or passively gathering information that can be used to support targeting. Such information may include details of the victim organization, infrastructure, or staff/personnel. This information can be leveraged by the adversary to aid in other phases of the adversary lifecycle, such as using gathered information to plan and execute Initial Access, to scope and prioritize post-compromise objectives, or to drive and lead further", "order": 1}
{"chunk_id": "3a59a04a-3569-5b98-8367-9387b0bd63d2", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Reconnaissance efforts.", "order": 2}
{"chunk_id": "a720f08b-2ab3-566d-be6a-51ae59a7dd14", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "ID: TA0043 Created: 02 October 2020 Last Modified: 25 April 2025 Version Permalink Live Version Techniques Techniques: 11", "order": 3}
{"chunk_id": "b408bae7-4ba7-54e7-90e8-abb28e2d53e0", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "ID Name Description T1595 Active Scanning Adversaries may execute active reconnaissance scans to gather information that can be used during targeting. Active scans are those where the adversary probes victim infrastructure via network traffic, as opposed to other forms of reconnaissance that do not involve direct interaction.", "order": 4}
{"chunk_id": "be32b457-6afd-5b93-bd65-ad0cdca09712", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".001 Scanning IP Blocks Adversaries may scan victim IP blocks to gather information that can be used during targeting. Public IP addresses may be allocated to organizations by block, or a range of sequential addresses.", "order": 5}
{"chunk_id": "9092f989-a1e0-5642-8e48-ce66433339f1", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".002 Vulnerability Scanning Adversaries may scan victims for vulnerabilities that can be used during targeting. Vulnerability scans typically check if the configuration of a target host/application (ex: software and version) potentially aligns with the target of a specific exploit the adversary may seek to use.", "order": 6}
{"chunk_id": "2b754813-af51-5dcb-aa02-65988466bfb3", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".003 Wordlist Scanning", "order": 7}
{"chunk_id": "b9aa920e-8cda-57dd-bac3-c4d26dee5381", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Adversaries may iteratively probe infrastructure using brute-forcing and crawling techniques. While this technique employs similar methods to Brute Force , its goal is the identification of content and infrastructure rather than the discovery of valid credentials. Wordlists used in these scans may contain generic, commonly used names and file extensions or terms specific to a particular software. Adversaries may also create custom, target-specific wordlists using", "order": 8}
{"chunk_id": "80d2a5b6-fe30-59cf-9f2b-c984c4878784", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "data gathered from other Reconnaissance techniques (ex: Gather Victim Org Information , or Search Victim-Owned Websites ).", "order": 9}
{"chunk_id": "7b9e0974-49ef-5042-9366-90597c5b1f4a", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "T1592 Gather Victim Host Information Adversaries may gather information about the victim's hosts that can be used during targeting. Information about hosts may include a variety of details, including administrative data (ex: name, assigned IP, functionality, etc.) as well as specifics regarding its configuration (ex: operating system, language, etc.).", "order": 10}
{"chunk_id": "8251a0f7-8f90-5792-ac33-07ddbc5547d3", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".001 Hardware Adversaries may gather information about the victim's host hardware that can be used during targeting. Information about hardware infrastructure may include a variety of details such as types and versions on specific hosts, as well as the presence of additional components that might be indicative of added defensive protections (ex: card/biometric readers, dedicated encryption hardware, etc.).", "order": 11}
{"chunk_id": "7f6b13c7-0b7d-5689-9b9e-0c87f00d0851", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".002 Software Adversaries may gather information about the victim's host software that can be used during targeting. Information about installed software may include a variety of details such as types and versions on specific hosts, as well as the presence of additional components that might be indicative of added defensive protections (ex: antivirus, SIEMs, etc.).", "order": 12}
{"chunk_id": "42c2575b-74bd-56c3-b5ca-b07593e02359", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".003 Firmware Adversaries may gather information about the victim's host firmware that can be used during targeting. Information about host firmware may include a variety of details such as type and versions on specific hosts, which may be used to infer more information about hosts in the environment (ex: configuration, purpose, age/patch level, etc.).", "order": 13}
{"chunk_id": "579e2ab8-21c4-5e7c-9298-69961f49d649", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".004 Client Configurations Adversaries may gather information about the victim's client configurations that can be used during targeting. Information about client configurations may include a variety of details and settings, including operating system/version, virtualization, architecture (ex: 32 or 64 bit), language, and/or time zone.", "order": 14}
{"chunk_id": "235f692c-e346-56c0-8939-238fca8f63ff", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "T1589 Gather Victim Identity Information Adversaries may gather information about the victim's identity that can be used during targeting. Information about identities may include a variety of details, including personal data (ex: employee names, email addresses, security question responses, etc.) as well as sensitive details such as credentials or multi-factor authentication (MFA) configurations.", "order": 15}
{"chunk_id": "6003a8b5-ae03-5831-8bdd-f3b7d0fb22b4", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".001 Credentials Adversaries may gather credentials that can be used during targeting. Account credentials gathered by adversaries may be those directly associated with the target victim organization or attempt to take advantage of the tendency for users to use the same passwords across personal and business accounts.", "order": 16}
{"chunk_id": "a578ec08-32c7-52b3-a8b6-4298f96fe02c", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".002 Email Addresses Adversaries may gather email addresses that can be used during targeting. Even if internal instances exist, organizations may have public-facing email infrastructure and addresses for employees. .003 Employee Names Adversaries may gather employee names that can be used during targeting. Employee names be used to derive email addresses as well as to help guide other reconnaissance efforts and/or craft more-believable lures.", "order": 17}
{"chunk_id": "95e05eeb-999f-53de-8960-c4befd8079f2", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "T1590 Gather Victim Network Information Adversaries may gather information about the victim's networks that can be used during targeting. Information about networks may include a variety of details, including administrative data (ex: IP ranges, domain names, etc.) as well as specifics regarding its topology and operations.", "order": 18}
{"chunk_id": "b6b59d4b-0456-5d94-99e6-1d3845781445", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".001 Domain Properties Adversaries may gather information about the victim's network domain(s) that can be used during targeting. Information about domains and their properties may include a variety of details, including what domain(s) the victim owns as well as administrative data (ex: name, registrar, etc.) and more directly actionable information such as contacts (email addresses and phone numbers), business addresses, and name servers.", "order": 19}
{"chunk_id": "59aaa026-3313-5af7-a8dc-20333b92127c", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".002 DNS Adversaries may gather information about the victim's DNS that can be used during targeting. DNS information may include a variety of details, including registered name servers as well as records that outline addressing for a target’s subdomains, mail servers, and other hosts. DNS MX, TXT, and SPF records may also reveal the use of third party cloud and SaaS providers, such as Office 365, G Suite, Salesforce, or Zendesk.", "order": 20}
{"chunk_id": "ba64a85b-f25b-5c89-8785-3504c8ab3d4b", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".003 Network Trust Dependencies Adversaries may gather information about the victim's network trust dependencies that can be used during targeting. Information about network trusts may include a variety of details, including second or third-party organizations/domains (ex: managed service providers, contractors, etc.) that have connected (and potentially elevated) network access.", "order": 21}
{"chunk_id": "8c799077-a18d-505f-b498-b36e671e316c", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".004 Network Topology Adversaries may gather information about the victim's network topology that can be used during targeting. Information about network topologies may include a variety of details, including the physical and/or logical arrangement of both external-facing and internal network environments. This information may also include specifics regarding network devices (gateways, routers, etc.) and other infrastructure.", "order": 22}
{"chunk_id": "81f110bc-e093-5a86-a438-5cc7def7a7d4", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".005 IP Addresses", "order": 23}
{"chunk_id": "66e597f6-5899-5876-9536-f2e2389f8ff8", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Adversaries may gather the victim's IP addresses that can be used during targeting. Public IP addresses may be allocated to organizations by block, or a range of sequential addresses. Information about assigned IP addresses may include a variety of details, such as which IP addresses are in use. IP addresses may also enable an adversary to derive other details about a victim, such as organizational size, physical location(s), Internet service provider, and or", "order": 24}
{"chunk_id": "51ee4886-e1bc-52d3-aee8-462d2d89acca", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "where/how their publicly-facing infrastructure is hosted.", "order": 25}
{"chunk_id": "19b63407-ccc8-55ca-888e-7a3a80937dee", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".006 Network Security Appliances", "order": 26}
{"chunk_id": "9531ac8b-dfe1-51df-ad52-6a9e06131416", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Adversaries may gather information about the victim's network security appliances that can be used during targeting. Information about network security appliances may include a variety of details, such as the existence and specifics of deployed firewalls, content filters, and proxies/bastion hosts. Adversaries may also target information about victim network-based intrusion detection systems (NIDS) or other appliances related to defensive cybersecurity operations.", "order": 27}
{"chunk_id": "ced9b66e-0c2d-5730-867b-82e9f5e6aadc", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "T1591 Gather Victim Org Information Adversaries may gather information about the victim's organization that can be used during targeting. Information about an organization may include a variety of details, including the names of divisions/departments, specifics of business operations, as well as the roles and responsibilities of key employees.", "order": 28}
{"chunk_id": "041e461a-8b00-5c42-9457-d6e9e72d5779", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".001 Determine Physical Locations Adversaries may gather the victim's physical location(s) that can be used during targeting. Information about physical locations of a target organization may include a variety of details, including where key resources and infrastructure are housed. Physical locations may also indicate what legal jurisdiction and/or authorities the victim operates within.", "order": 29}
{"chunk_id": "c9ea91f0-d743-596f-8dbf-e03bbae43a4e", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".002 Business Relationships", "order": 30}
{"chunk_id": "6e6cacdd-5f86-5c9d-878d-51fc4095532f", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Adversaries may gather information about the victim's business relationships that can be used during targeting. Information about an organization’s business relationships may include a variety of details, including second or third-party organizations/domains (ex: managed service providers, contractors, etc.) that have connected (and potentially elevated) network access. This information may also reveal supply chains and shipment paths for the victim’s hardware and software resources.", "order": 31}
{"chunk_id": "9109293d-e23c-5249-bff9-2a426a2fecec", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".003 Identify Business Tempo Adversaries may gather information about the victim's business tempo that can be used during targeting. Information about an organization’s business tempo may include a variety of details, including operational hours/days of the week. This information may also reveal times/dates of purchases and shipments of the victim’s hardware and software resources.", "order": 32}
{"chunk_id": "4865daf7-bf97-5322-952b-5174c4782d1d", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".004 Identify Roles Adversaries may gather information about identities and roles within the victim organization that can be used during targeting. Information about business roles may reveal a variety of targetable details, including identifiable information for key personnel as well as what data/resources they have access to.", "order": 33}
{"chunk_id": "56bdd3b7-87fa-52c8-8831-32af1cee3c31", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "T1598 Phishing for Information Adversaries may send phishing messages to elicit sensitive information that can be used during targeting. Phishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Phishing for information is different from Phishing in that the objective is gathering data from the victim rather than executing malicious code.", "order": 34}
{"chunk_id": "514dcf98-481a-5f0f-8b53-1ba5df729268", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".001 Spearphishing Service", "order": 35}
{"chunk_id": "4bc51769-58e2-5a56-bb85-fb5cf541eefb", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Adversaries may send spearphishing messages via third-party services to elicit sensitive information that can be used during targeting. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Spearphishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Establish Accounts or Compromise", "order": 36}
{"chunk_id": "45febd7b-8ec6-540d-954a-2af0ea1fa4bb", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Accounts ) and/or sending multiple, seemingly urgent messages.", "order": 37}
{"chunk_id": "90634bc2-3b69-5699-8b85-99d4f669c0c3", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".002 Spearphishing Attachment", "order": 38}
{"chunk_id": "fb5021d6-f0bd-5b5d-bc6f-9c54ad57d188", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Adversaries may send spearphishing messages with a malicious attachment to elicit sensitive information that can be used during targeting. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Spearphishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Establish Accounts or Compromise", "order": 39}
{"chunk_id": "be5a5183-4afe-5364-b2ea-a282e46e15f0", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Accounts ) and/or sending multiple, seemingly urgent messages.", "order": 40}
{"chunk_id": "73c40f1d-a790-5146-91b5-14b03fcf5054", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".003 Spearphishing Link", "order": 41}
{"chunk_id": "61a3d08d-d6c9-5811-bc7d-e8181ba7a54f", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Adversaries may send spearphishing messages with a malicious link to elicit sensitive information that can be used during targeting. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Spearphishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Establish Accounts or Compromise", "order": 42}
{"chunk_id": "177baa68-a10b-5e3f-b32f-e27f777b6592", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Accounts ) and/or sending multiple, seemingly urgent messages.", "order": 43}
{"chunk_id": "6a854727-3dca-5fbc-adc9-adbfe5818719", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".004 Spearphishing Voice", "order": 44}
{"chunk_id": "44858a72-3d25-52f8-8f4c-62ddfb0a3ebe", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Adversaries may use voice communications to elicit sensitive information that can be used during targeting. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Spearphishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Impersonation ) and/or creating a sense of urgency or alarm for the recipient.", "order": 45}
{"chunk_id": "bd67ef3b-7d54-5db9-abea-776998b1c512", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "T1597 Search Closed Sources Adversaries may search and gather information about victims from closed (e.g., paid, private, or otherwise not freely available) sources that can be used during targeting. Information about victims may be available for purchase from reputable private sources and databases, such as paid subscriptions to feeds of technical/threat intelligence data. Adversaries may also purchase information from less-reputable sources such as dark web or cybercrime blackmarkets.", "order": 46}
{"chunk_id": "71552a7b-d202-584f-9a4c-a514278ca155", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".001 Threat Intel Vendors Adversaries may search private data from threat intelligence vendors for information that can be used during targeting. Threat intelligence vendors may offer paid feeds or portals that offer more data than what is publicly reported. Although sensitive details (such as customer names and other identifiers) may be redacted, this information may contain trends regarding breaches such as target industries, attribution claims, and successful TTPs/countermeasures.", "order": 47}
{"chunk_id": "fcb886df-ba7f-5b87-9d44-6536be95500f", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".002 Purchase Technical Data Adversaries may purchase technical information about victims that can be used during targeting. Information about victims may be available for purchase within reputable private sources and databases, such as paid subscriptions to feeds of scan databases or other data aggregation services. Adversaries may also purchase information from less-reputable sources such as dark web or cybercrime blackmarkets.", "order": 48}
{"chunk_id": "e6fc0aa4-0d07-5ee7-b8f2-cdf32d507935", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "T1596 Search Open Technical Databases Adversaries may search freely available technical databases for information about victims that can be used during targeting. Information about victims may be available in online databases and repositories, such as registrations of domains/certificates as well as public collections of network data/artifacts gathered from traffic and/or scans.", "order": 49}
{"chunk_id": "d30b9ea8-a785-5a91-91bb-dad92b1ab46c", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".001 DNS/Passive DNS Adversaries may search DNS data for information about victims that can be used during targeting. DNS information may include a variety of details, including registered name servers as well as records that outline addressing for a target’s subdomains, mail servers, and other hosts.", "order": 50}
{"chunk_id": "141f73c3-81e5-5c98-897e-9181b59e515d", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".002 WHOIS Adversaries may search public WHOIS data for information about victims that can be used during targeting. WHOIS data is stored by regional Internet registries (RIR) responsible for allocating and assigning Internet resources such as domain names. Anyone can query WHOIS servers for information about a registered domain, such as assigned IP blocks, contact information, and DNS nameservers.", "order": 51}
{"chunk_id": "0e4825bb-c8db-5c17-8070-e2e4e333df89", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".003 Digital Certificates Adversaries may search public digital certificate data for information about victims that can be used during targeting. Digital certificates are issued by a certificate authority (CA) in order to cryptographically verify the origin of signed content. These certificates, such as those used for encrypted web traffic (HTTPS SSL/TLS communications), contain information about the registered organization such as name and location.", "order": 52}
{"chunk_id": "3ab956f0-e602-5e34-9da2-0b6938c2baca", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".004 CDNs Adversaries may search content delivery network (CDN) data about victims that can be used during targeting. CDNs allow an organization to host content from a distributed, load balanced array of servers. CDNs may also allow organizations to customize content delivery based on the requestor’s geographical region.", "order": 53}
{"chunk_id": "fef95c2a-456d-5dc1-bbac-3b724e069834", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".005 Scan Databases Adversaries may search within public scan databases for information about victims that can be used during targeting. Various online services continuously publish the results of Internet scans/surveys, often harvesting information such as active IP addresses, hostnames, open ports, certificates, and even server banners.", "order": 54}
{"chunk_id": "b73b42ee-bd98-57eb-a9f6-4c86304d778b", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "T1593 Search Open Websites/Domains Adversaries may search freely available websites and/or domains for information about victims that can be used during targeting. Information about victims may be available in various online sites, such as social media, new sites, or those hosting information about business operations such as hiring or requested/rewarded contracts.", "order": 55}
{"chunk_id": "7194d1af-7949-56a2-9b22-a4b3a3faef7d", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".001 Social Media Adversaries may search social media for information about victims that can be used during targeting. Social media sites may contain various information about a victim organization, such as business announcements as well as information about the roles, locations, and interests of staff.", "order": 56}
{"chunk_id": "d1aa7d1e-5ce7-5bed-95a3-b46515b74066", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".002 Search Engines Adversaries may use search engines to collect information about victims that can be used during targeting. Search engine services typical crawl online sites to index context and may provide users with specialized syntax to search for specific keywords or specific types of content (i.e. filetypes).", "order": 57}
{"chunk_id": "69ca95d9-5c4f-5d45-a8c4-644dd42d1541", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": ".003 Code Repositories Adversaries may search public code repositories for information about victims that can be used during targeting. Victims may store code in repositories on various third-party websites such as GitHub, GitLab, SourceForge, and BitBucket. Users typically interact with code repositories through a web application or command-line utilities such as git.", "order": 58}
{"chunk_id": "00cbb274-4d9a-50da-b553-ab646a466952", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "T1681 Search Threat Vendor Data", "order": 59}
{"chunk_id": "66bec75f-52c3-5e62-a798-d5464c10f862", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Threat actors may seek information/indicators from closed or open threat intelligence sources gathered about their own campaigns, as well as those conducted by other adversaries that may align with their target industries, capabilities/objectives, or other operational concerns. These reports may include descriptions of behavior, detailed breakdowns of attacks, atomic indicators such as malware hashes or IP addresses, timelines of a group’s activity, and more.", "order": 60}
{"chunk_id": "68164a88-513f-5fbd-a9f2-6a825836da8c", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "Adversaries may change their behavior when planning their future operations.", "order": 61}
{"chunk_id": "af672a44-8077-553d-8a2a-529440a762e9", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "TableChunk", "text": "T1594 Search Victim-Owned Websites Adversaries may search websites owned by the victim for information that can be used during targeting. Victim-owned websites may contain a variety of details, including names of departments/divisions, physical locations, and data about key employees such as names, roles, and contact info (ex: Email Addresses ). These sites may also have details highlighting business operations and relationships.", "order": 62}
{"chunk_id": "5fcf4437-4538-5645-9381-ab236d7b0ab1", "doc_id": "c6d59d15-a06d-59bb-9b25-de9a143d0a0d", "filename": "TA0043.html", "filetype": "text/html", "page_number": null, "element_type": "CompositeElement", "text": "Contact Us Terms of Use Privacy Policy Website Changelog Cookie Preferences © 2015 - 2025, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.", "order": 63}
